Repository: jfenal-zz/fedora-trans-fr
Catalog: for_translation_iwhd_iwhdpot_*.po
Languages: fr_fr

source: stat %s failed
fr_fr: échec de stat %s

source: path %s is not a directory
fr_fr: le chemin %s n'est pas un répertoire

source: Cannot create %s
fr_fr: Impossible de créer %s

source: path %s is not a regular file
fr_fr: le chemin %s n'est pas un fichier

source: fork failed
fr_fr: échec du clonage

source: failed to run command %s
fr_fr: échec du lancement de la commande %s

source: failed to verify mongod using port %s
fr_fr: impossible de vérifier mongod sur le port %s

source: something is listening on port %s, not auto-starting Mongo
fr_fr: quelque chose écoute sur le port %s, Mongo ne sera pas démarré

source: atexit failed for auto_stop
fr_fr: atexit a échoué pour auto_stop

source: hostname %s too long in %s
fr_fr: nom de système %s trop long dans %s

source: missing Content-Length
fr_fr: Content-Length manquant

source: %s: failed to create file from template
fr_fr: %s : échec de la création du fichier depuis le modèle

source: failed to write to %s
fr_fr: échec de l'écriture sur %s

source: missing EC2 API key
fr_fr: clé d'API EC2 manquante

source: missing EC2 API secret
fr_fr: secret d'API EC2 manquant

source: missing EC2 AMI cert
fr_fr: certificat d'AMI EC2 manquant

source: missing EC2 AMI key
fr_fr: clé d'AMI EC2 manquant

source: missing EC2 AMI uid
fr_fr: uid d'AMI EC2 manquant

source: pipe creation failed
fr_fr: échec de la création du tube

source: could not open parent pipe stream
fr_fr: impossible d'ouvrir le flux du tube parent

source: waitpid failed
fr_fr: échec de waitpid

source: %s is killed (status 0x%x)
fr_fr: %s est tué (état 0x%x)

source: %s exited with code %d
fr_fr: %s s'est terminé avec le code %d

source: path too long in %s
fr_fr: chemin trop long dans %s

source: no memory in %s
fr_fr: plus de mémoire dans %s

source: auth_hdr too long
fr_fr: auth_hdr trop long

source: API URL too long in %s
fr_fr: URL de l'API trop longue dans %s

source: auth_user too long in %s
fr_fr: auth_user trop long dans %s

source: auth_key too long in %s
fr_fr: auth_key trop long dans %s

source: chdir failed, unsafe to continue
fr_fr: échec de chdir, il ne serait pas sûr de continuer

source: %s: read failed
fr_fr: %s : échec en lecture

source: unlink failed for %s
fr_fr: échec de unlink pour %s

source: %s: write failed
fr_fr: %s : échec en écriture

source: %s: failed to unlink
fr_fr: %s : échec de la suppression

source: %s: failed to create directory
fr_fr: %s : échec de la création de répertoire

source: missing RHEV-M API URL (api-url)
fr_fr: URL d'API RHEV-M (api-url) manquante

source: missing RHEV-M API username (api-key)
fr_fr: nom d'utilisateur d'API RHEV-M (api-key) manquant

source: missing RHEV-M API secret (api-secret)
fr_fr: secret d'API RHEV-M (api-secret) manquant

source: missing export domain's host (nfs-host)
fr_fr: système du domaine d'export du système (nfs-host) manquant

source: missing export domain's path (nfs-path)
fr_fr: chemin du domaine d'export du système (nfs-path) manquant

source: missing target directory (nfs-dir)
fr_fr: répertoire cible manquant (nfs-dir)

source: no core
fr_fr: pas de cœur

source: cannot create a temporary file
fr_fr: impossible de créer un fichier temporaire

source: missing target directory (nfs-dir,nfsdir)
fr_fr: répertoire cible manquant (nfs-dir, nfsdir)

source: missing vSphere API URL (api-url)
fr_fr: URL d'API vSphere (api-url) manquante

source: missing vSphere API username (api-key)
fr_fr: nom d'utilisateur d'API vSphere (api-key) manquant

source: missing vSphere API secret (api-secret)
fr_fr: secret d'API vSphere (api-secret) manquant

source: missing ESXi host (vm-host)
fr_fr: système ESXi (vm-host) manquant

source: write error
fr_fr: erreur en écriture

source: preserving permissions for %s
fr_fr: préservation des permissions pour %s

source: error while opening "%s" for reading
fr_fr: erreur à l'ouverture de « %s » en lecture

source: cannot open backup file "%s" for writing
fr_fr: erreur à l'ouverture de « %s » en écriture

source: error reading "%s"
fr_fr: erreur à lecture de « %s »

source: error writing "%s"
fr_fr: erreur à l'écriture sur « %s »

source: error after reading "%s"
fr_fr: erreur après la lecture de « %s »

source: Unknown system error
fr_fr: Erreur système inconnue

source: %s: option '%s' is ambiguous; possibilities:
fr_fr: %s : l'option '%s' est ambigüe ; les possibilités sont :

source: %s: option '--%s' doesn't allow an argument
fr_fr: %s : l'option '--%s' n'autorise pas d'argument

source: %s: option '%c%s' doesn't allow an argument
fr_fr: %s : l'option '%c%s' n'autorise pas d'argument

source: %s: option '--%s' requires an argument
fr_fr: %s : l'option '--%s' requiert un argument

source: %s: unrecognized option '--%s'
fr_fr: %s : option '--%s' non reconnue

source: %s: unrecognized option '%c%s'
fr_fr: %s : option '%c%s' non reconnue

source: %s: invalid option -- '%c'
fr_fr: %s : option invalide -- '%c'

source: %s: option requires an argument -- '%c'
fr_fr: %s : l'option requiert un argument -- '%c'

source: %s: option '-W %s' is ambiguous
fr_fr: %s : l'option '-W %s' est ambigüe

source: %s: option '-W %s' doesn't allow an argument
fr_fr: %s : l'option '-W %s' n'autorise pas d'argument

source: %s: option '-W %s' requires an argument
fr_fr: %s : l'option '-W %s' requiert un argument

source: setting permissions for %s
fr_fr: application des permissions sur %s

source: Packaged by %s (%s)
fr_fr: Emballé par %s (%s)

source: Packaged by %s
fr_fr: Emballé par %s

source: License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>. This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
fr_fr: Licence GPLv3+ : GNU GPL version 3 ou ultérieure <http://gnu.org/licenses/gpl.html>. Ceci est un logiciel libre : vous êtes libre de le modifier et le redistribuer. Il n'y AUCUNE GARANTIE, dans la limite de la loi.

source: Written by %s.
fr_fr: Écrit par %s.

source: Written by %s and %s.
fr_fr: Écrit par %s et %s.

source: Written by %s, %s, and %s.
fr_fr: Écrit par %s, %s et %s.

source: Written by %s, %s, %s, and %s.
fr_fr: Écrit par %s, %s, %s et %s.

source: Written by %s, %s, %s, %s, and %s.
fr_fr: Écrit par %s, %s, %s, %s et %s.

source: Written by %s, %s, %s, %s, %s, and %s.
fr_fr: Écrit par %s, %s, %s, %s, %s et %s.

source: Written by %s, %s, %s, %s, %s, %s, and %s.
fr_fr: Écrit par %s, %s, %s, %s, %s, %s et %s.

source: Written by %s, %s, %s, %s, %s, %s, %s, and %s.
fr_fr: Écrit par %s, %s, %s, %s, %s, %s, %s et %s.

source: Written by %s, %s, %s, %s, %s, %s, %s, %s, and %s.
fr_fr: Écrit par %s, %s, %s, %s, %s, %s, %s, %s et %s.

source: Written by %s, %s, %s, %s, %s, %s, %s, %s, %s, and others.
fr_fr: Écrit par %s, %s, %s, %s, %s, %s, %s, %s, %s et d'autres.

source: Report bugs to: %s
fr_fr: Rapporter les bugs à : %s

source: Report %s bugs to: %s
fr_fr: Rapporter %s bugs à : %s

source: %s home page: <%s>
fr_fr: %s page de démarrage : <%s>

source: %s home page: <http://www.gnu.org/software/%s/>
fr_fr: %s page de démarrage : <http://www.gnu.org/software/%s/>

source: General help using GNU software: <http://www.gnu.org/gethelp/>
fr_fr: Aide générique sur l'utilisation de logiciels GNU : <http://www.gnu.org/gethelp/>

source: memory exhausted
fr_fr: mémoire épuisée

source: invalid %s%s argument `%s'
fr_fr: argument %s%s invalide « %s »

source: invalid suffix in %s%s argument `%s'
fr_fr: suffixe invalide dans l'argument %s%s « %s »

source: %s%s argument `%s' too large
fr_fr: argument %s%s « %s » trop grand

source: unable to open log `%s'
fr_fr: impossible d'ouvrir le journal « %s »

source: failed to flush stdout
fr_fr: impossible de vider stdout

source: unable to dup log to stdout
fr_fr: impossible de cloner le journal vers stdout

source: unable to dup log to stderr
fr_fr: impossible de cloner le journal vers stderr

source: failed to initialize query parser
fr_fr: impossible d'initialiser l'analyseur de requête

source: ran out of memory replicating delete for %s
fr_fr: épuisement de la mémoire lors de la réplication de la suppression pour %s

source: invalid path replicating delete for %s
fr_fr: chemin invalide lors de la réplication de la suppression pour %s

source: got status %d replicating delete for %s
fr_fr: état %d reçu lors de la réplication de la suppression pour %s

source: got status %d replicating bcreate for %s
fr_fr: état %d reçu lors de la réplication de bcreate pour %s

source: thread mutex init failed
fr_fr: échec de l'initialisation du mutex de fil d'exécution

source: bad repl type %d (url=%s) skipped
fr_fr: mauvais type repl %d (url=%s)

source: could not parse url %s
fr_fr: impossible d'analyser l'url %s

source: could not create repl_item for %s
fr_fr: impossible de créer le repl_item pour %s

source: failed to get policy for %s/%s
fr_fr: impossible d'obtenir la politique pour %s/%s

source: failed to get default policy
fr_fr: impossible d'obtenir la politique par défaut

source: invalid request: %s
fr_fr: requête invalide : %s

source: failed to extract provider name: %s
fr_fr: impossible d'extraire le nom du fournisseur : %s

source: Try `%s --help' for more information.
fr_fr: Essayer « %s --help » pour plus d'informations.

source: Usage: %s [OPTION]
fr_fr: Utilisation : %s [OPTION]

source: Aeolus' image-warehouse daemon. A configuration file must be specified. -a, --autostart start necessary back-end services -c, --config=FILE config file [required] -d, --db=HOST_PORT database server as ip[:port] -l, --logfile=FILE logfile (default stdout/stderr) -m, --master=HOST_PORT master (upstream) server as ip[:port] -o, --oauth enable OAuth -p, --port=PORT alternate listen port (default 9090) -u, --userlist=FILE list of user names, secrets -v, --verbose verbose/debug output --help display this help and exit --version output version information and exit
fr_fr: Aeolus' image-warehouse daemon. Démon de gestion d'images de Aeolus.Un fichier de configuration doit être spécifié. -a, --autostart démarrer les services de soutien nécessaires -c, --config=FILE fichier de configuration [requis] -d, --db=HOST_PORT serveur de base de données : ip[:port] -l, --logfile=FILE journal (par défaut : stdout/stderr) -m, --master=HOST_PORT serveur maître (amont) : ip[:port] -o, --oauth activer OAuth -p, --port=PORT port d'écoute alternatif (9090 par défaut) -u, --userlist=FILE liste de noms d'utilisateurs et secrets -v, --verbose mode verbeux/débogage --help afficher ce texte d'aide et quitter --version afficher les informations de version et quitter

source: The default RHEV-M import timeout is %d seconds.
fr_fr: Le timeout par défaut de RHEV-M est de %d secondes.

source: Report %s bugs to %s.
fr_fr: Rapporter %s bugs à %s

source: invalid port number: %s
fr_fr: numéro de port invalide : %s

source: invalid host name
fr_fr: nom de système invalide : %s

source: extra operand %s
fr_fr: opérande %s surnuméraire

source: A deprecated flag -U is specified, migrate to -u
fr_fr: L'option -U utilisée est obsolète, utilisation de -u

source: could not parse %s
fr_fr: impossible d'analyser %s

source: do not use -c and -a simultaneously
fr_fr: ne pas utiliser -c et -a simultanément

source: specify at least -c or -a
fr_fr: spécifier au moins -c ou -a

source: write failed
fr_fr: échec de l'écriture

source: failed to start daemon
fr_fr: échec au démarrage du démon

source: provider %s has no type
fr_fr: le fournisseur %s n'a pas de type

source: provider %s has invalid type: %s
fr_fr: le fournisseur %s a un type invalide : %s

source: %s: %s-provider requires a host
fr_fr: %s : le fournisseur %s requiert un nom de système

source: %s: %s-provider requires a port
fr_fr: %s : le fournisseur %s requiert un numéro de port

source: %s: %s-provider: invalid port: %s
fr_fr: %s : fournisseur %s : port invalide : %s

source: %s: %s-provider requires a key
fr_fr: %s : le fournisseur %s requiert une clé

source: %s: %s-provider requires a secret
fr_fr: %s : le fournisseur %s requiert un secret

source: %s: %s-provider requires a path
fr_fr: %s : le fournisseur %s requiert un chemin

source: config elem %u: missing object
fr_fr: élément de configuration %u : objet manquant

source: config elem %u: missing name
fr_fr: élément de configuration %u : nom manquant

source: config elem %u (%s): missing type
fr_fr: élément de configuration %u : type manquant

source: config elem %u (%s): bad type
fr_fr: élément de configuration %u (%s) : mauvais type

source: config elem %u (%s): missing host
fr_fr: élément de configuration %u (%s) : nom de système manquant

source: config elem %u (%s): missing port
fr_fr: élément de configuration %u (%s) : numéro de port manquant

source: config elem %u (%s): missing key
fr_fr: élément de configuration %u (%s) : clé manquante

source: config elem %u (%s): missing secret
fr_fr: élément de configuration %u (%s) : secret manquant

source: config elem %u (%s): missing path
fr_fr: élément de configuration %u (%s) : chemin manquant

source: config elem %u (%s): timeout is honored only with fs-rhev-m
fr_fr: élément de configuration %u (%s) : le timeout est honoré uniquement avec fs-rhev-m

source: convert-provider: ITER key: %s
fr_fr: fournisseur de contenu : clé ITER : %s

source: exhausted virtual memory
fr_fr: mémoire virtuelle épuisée

source: could not extract %u.%s
fr_fr: impossible d'extraire %u.%s

source: ignoring invalid import-timeout: %s
fr_fr: on ignore le timeout d'import invalide : %s

source: no value for %s
fr_fr: aucune valeur pour %s

source: config should be a JSON array
fr_fr: la configuration devrait être un tableau JSON

source: could not allocate provider hash
fr_fr: impossible d'allouer la table de hachage des fournisseurs

source: could not get pointer to provider %u
fr_fr: impossible d'obtenir le pointeur vers le fournisseur %u

source: could not copy key %u
fr_fr: impossible de copier la clé %u

source: could not allocate provider %u
fr_fr: impossible d'allouer le fournisseur %u

source: could not add provider %u
fr_fr: impossible d'ajouter le fournisseur %u

source: failed to open %s for reading
fr_fr: impossible d'ouvrir %s en lecture

source: JSON error on line %d: %s
fr_fr: Erreur JSON sur la ligne %d : %s

source: invalid autostart configuration (internal error)
fr_fr: configuration autostart invalide (erreur interne)

source: The -U argument must contain a colon
fr_fr: L'argument -U doit contenir un « : »

source: The user part of -U argument is empty
fr_fr: La partie utilisateur de l'argument -U est vide

source: User name too long
fr_fr: Le nom d'utilisateur est trop long

source: User password too long
fr_fr: Le mot de passe de l'utilisateur est trop long

source: user list must be a JSON array
fr_fr: la liste d'utilisateurs doit être un tableau JSON

source: could not get pointer to user %u
fr_fr: impossible d'obtenir le pointeur vers l'utilisateur %u

source: config elem %u: missing secret
fr_fr: élément de configuration %u : secret manquant
