Repository: jfenal-zz/fedora-trans-fr
Catalog: for_translation_resource-management-guide_Using_Control_Groups_*.po
Languages: fr

source: displays the values of <filename>cpuset.cpus</filename> and <filename>memory.limit_in_bytes</filename> for cgroups <systemitem>lab1</systemitem> and <systemitem>lab2</systemitem>.
fr: affiche les valeurs de <filename>cpuset.cpus</filename> et <filename>memory.limit_in_bytes</filename> des groupes de contrôle <systemitem>lab1</systemitem> et <systemitem>lab2</systemitem>.

source: If you do not know the names of the parameters themselves, use a command like:
fr: Si les noms des paramètres ne sont pas connus, utiliser une commande comme :

source: Unloading Control Groups
fr: Décharger les groupes de contrôle

source: This command destroys all control groups
fr: Cette commande supprime tous les groupes de contrôle

source: The <command>cgclear</command> command destroys all cgroups in all hierarchies. If you do not have these hierarchies stored in a configuration file, you will not be able to readily reconstruct them.
fr: La commande <command>cgclear</command> supprime tous les groupes de contrôle dans toutes les hiérarchies. Si ces hiérarchies n'ont pas été stockées dans un fichier de configuration, elle ne pourront être reconstruites facilement.

source: To clear an entire cgroup file system, use the <command>cgclear</command> command.
fr: Pour supprimer un système de fichiers de groupe de contrôle en entier, utiliser la commande <command>cgclear</command>.

source: All tasks in the cgroup are reallocated to the root node of the hierarchies, all cgroups are removed, and the file system itself is unmounted from the system, thus destroying all previously mounted hierarchies. Finally, the directory where the cgroup file system was mounted is actually deleted.
fr: Toutes les tâches dans le groupe de contrôle sont réaffectées au noeud racine (root) des hiérarchies, tous les groupes de contrôle sont supprimés, et le système de fichiers lui-même est démonté du système, détruisant ainsi toutes les hiérarchies précédemment montées. Finalement, le répertoire où le système de fichiers du groupe de contrôle était monté est effectivement supprimé.

source: Accurate listing of all mounted cgroups
fr: Liste exacte de tous les cgroups montés

source: Using the <command>mount</command> command to create cgroups (as opposed to creating them using the <systemitem class="service">cgconfig</systemitem> service) results in the creation of an entry in the <filename>/etc/mtab</filename> file (the mounted file systems table). This change is also reflected into the <filename>/proc/mounts</filename> file. However, the unloading of cgroups with the <command>cgclear</command> command, along with other <application>cgconfig</application> commands, uses a direct kernel interface which does not reflect its changes into the <filename>/etc/mtab</filename> file and only writes the new information into the <filename>/proc/mounts</filename> file. Thus, after unloading cgroups with the <command>cgclear</command> command, the unmounted cgroups may still be visible in the <filename>/etc/mtab</filename> file, and, consequently, displayed when the <command>mount</command> command is executed. Refer to the <filename>/proc/mounts</filename> file for an accurate listing of all mounted cgroups.
fr: L'utilisation de la commande <command>mount</command> pour créer les cgroups (par opposition àleur création à l'aide du service <systemitem class="service">cgconfig</systemitem>) aboutit à la création d'une entrée dans le<filename>/etc/mtab</filename> (le fichier contenant la liste des systèmes de fichiers montés). Ce changement est également reflété dans le fichier <filename>/proc/mounts</filename>.Toutefois, le déchargement des cgroups avec la commande <command>cgclear</command>, de même que les autres commandes <command>cgconfig</command>, utilisent une interface directe avec le noyau dont les changements ne seront pas reflétés dans le fichier <filename>/etc/mtab</filename> mais uniquement dans le fichier <filename>/proc/mounts</filename>. Ainsi, après le déchargement de cgroups avec la commande <command>cgclear</command>, ces cgroups démontés pourront être encorevisibles dans le fichier <filename>/etc/mtab</filename>, et, par conséquent,affichés lorsque la commande <command>mount</command> est exécutée. Se reporter au contenu du fichier <filename>/proc/mounts</filename> pour une liste précise de tous lescgroups montés.

source: Additional Resources
fr: Ressources supplémentaires

source: The definitive documentation for cgroup commands are the manual pages provided with the <package>libcgroup-tools</package> package. The section numbers are specified in the list of man pages below.
fr: La documentation de référence pour les commandes cgroup sont les pages de manuelfournies avec le paquetage <package>libcgroup-tools</package>. Les numéros de sectionsont indiqués dans la liste des pages de manuel ci-dessous.

source: The libcgroup-tools Man Pages
fr: Les pages de manuel de libcgroup-tools

source: <command>man 1 cgclassify</command> — the <command>cgclassify</command> command is used to move running tasks to one or more cgroups.
fr: <command>man 1 cgclassify</command> — la commande <command>cgclassify</command> est utilisée pour déplacer des tâches en cours d'exécution sur un ou plusieurs groupes de contrôle.

source: <command>man 1 cgclear</command> — the <command>cgclear</command> command is used to delete all cgroups in a hierarchy.
fr: <command>man 1 cgclear</command> — la commande <command>cgclear</command> est utilisée pour supprimer tous les groupes de contrôle dans une hiérarchie.

source: <command>man 5 cgconfig.conf</command> — cgroups are defined in the <filename>cgconfig.conf</filename> file.
fr: <command>man 5 cgconfig.conf</command> — les groupes de contrôle sont définis dans le fichier <filename>cgconfig.conf</filename>.

source: <command>man 8 cgconfigparser</command> — the <command>cgconfigparser</command> command parses the <filename>cgconfig.conf</filename> file and mounts hierarchies.
fr: <command>man 8 cgconfigparser</command> — la commande <command>cgconfigparser</command> analyse le fichier <filename>cgconfig.conf</filename> et monte les hiérarchies.

source: <command>man 1 cgcreate</command> — the <command>cgcreate</command> command creates new cgroups in hierarchies.
fr: <command>man 1 cgcreate</command> — la commande <command>cgcreate</command> crée de nouveaux groupes de contrôle dans les hiérarchies.

source: <command>man 1 cgdelete</command> — the <command>cgdelete</command> command removes specified cgroups.
fr: <command>man 1 cgdelete</command> — la commande <command>cgdelete</command> supprime les groupes de contrôles spécifiés.

source: <command>man 1 cgexec</command> — the <command>cgexec</command> command runs tasks in specified cgroups.
fr: <command>man 1 cgexec</command> — la commande <command>cgexec</command> exécute des tâches dans les groupes de contrôle spécifiés.

source: <command>man 1 cgget</command> — the <command>cgget</command> command displays cgroup parameters.
fr: <command>man 1 cgget</command> — la commande <command>cgget</command> affiche les paramètres des groupes de contrôle.

source: <command>man 1 cgsnapshot</command> — the <command>cgsnapshot</command> command generates a configuration file from existing subsystems.
fr: <command>man 1 cgsnapshot</command> — la commande <command>cgsnapshot</command> génère un fichier de configuration à partir des sous-systèmes existants.

source: <command>man 5 cgred.conf</command> — <filename>cgred.conf</filename> is the configuration file for the <systemitem class="daemon">cgred</systemitem> service.
fr: <command>man 5 cgred.conf</command> — <filename>cgred.conf</filename> est le fichier de configuration du service <systemitem class="daemon">cgred</systemitem>.

source: <command>man 5 cgrules.conf</command> — <filename>cgrules.conf</filename> contains the rules used for determining when tasks belong to certain cgroups.
fr: <command>man 5 cgrules.conf</command> — le fichier <filename>cgrules.conf</filename> contient les règles utilisées pour déterminer les tâches qui appartiennent à certains groupes de contrôle.

source: <command>man 8 cgrulesengd</command> — the <systemitem class="daemon">cgrulesengd</systemitem> service distributes tasks to cgroups.
fr: <command>man 8 cgrulesengd</command> — le service <systemitem class="daemon">cgrulesengd</systemitem> distribue les tâches aux groupes de contrôle.

source: <command>man 1 cgset</command> — the <command>cgset</command> command sets parameters for a cgroup.
fr: <command>man 1 cgset</command> — la commande <command>cgset</command> définit les paramètres d'un groupe de contrôle.

source: <command>man 1 lscgroup</command> — the <command>lscgroup</command> command lists the cgroups in a hierarchy.
fr: <command>man 1 lscgroup</command> — la commande <command>lscgroup</command> répertorie les groupes de contrôle dans une hiérarchie.

source: <command>man 1 lssubsys</command> — the <command>lssubsys</command> command lists the hierarchies containing the specified subsystems.
fr: <command>man 1 lssubsys</command> — la commande <command>lssubsys</command> répertorie les hiérarchies contenant des sous-systèmes spécifiés.
