Repository: jfenal-zz/fedora-trans-fr
Catalog: for_translation_resource-management-guide_Subsystems_and_Tunable_Parameters_*.po
Languages: fr

source: reports the total time (in nanoseconds — ns) a cgroup spent waiting for a timeslice for one of its queues. The report is updated every time a queue for this cgroup gets a timeslice, so if you read this pseudofile while the cgroup is waiting for a timeslice, the report will not contain time spent waiting for the operation currently queued. Note that this report is available only if <literal>CONFIG_DEBUG_BLK_CGROUP=y</literal> is set on the system.
fr: rapporte la durée totale (en nanosecondes — ns) qu'un groupe de contrôle a attendu une tranche de temps pour l'une de ses files d'attente. Le rapport est mis à jour à chaque fois qu'une file d'attente de ce groupe de contrôle obtient une tranche de temps. Ainsi, si on lit ce pseudo-fichier alors que le groupe de contrôle attend sa tranche de temps, le rapport ne contiendra pas le temps attendu pour l'opération se trouvant actuellement en file d'attente. Remarquer que ce rapport est uniquement disponible si <literal>CONFIG_DEBUG_BLK_CGROUP=y</literal> est installé sur le système.

source: reports the total time (in nanoseconds — ns) a cgroup spent without any pending requests. The report is updated every time a queue for this cgroup has a pending request, so if you read this pseudofile while the cgroup has no pending requests, the report will not contain time spent in the current empty state. Note that this report is available only if <literal>CONFIG_DEBUG_BLK_CGROUP=y</literal> is set on the system.
fr: rapporte la durée totale (en nanosecondes — ns) qu'un groupe de contrôle a attendu sans requête en attente. Le rapport est mis à jour à chaque fois qu'une file d'attente de ce groupe de contrôle possède une requête en attente. Ainsi, si on lit ce pseudo-fichier alors que le groupe de contrôle ne possède pas de requêtes en attente, le rapport ne contiendra pas le temps attendu dans l'état actuel. Remarquer que ce rapport est uniquement disponible si <literal>CONFIG_DEBUG_BLK_CGROUP=y</literal> est installé sur le système.

source: reports the total time (in nanoseconds — ns) the scheduler spent idling for a cgroup in anticipation of a better request than those requests already in other queues or from other groups. The report is updated every time the group is no longer idling, so if you read this pseudofile while the cgroup is idling, the report will not contain time spent in the current idling state. Note that this report is available only if <literal>CONFIG_DEBUG_BLK_CGROUP=y</literal> is set on the system.
fr: rapporte le temps total (en nanosecondes — ns) que le planificateur a passé à attendre un groupe de contrôle dans l'attente d'une meilleure requête que les requêtes se trouvant déjà dans des files d'attente ou provenant d'autres groupes. Le rapport est mis à jour à chaque fois qu'un groupe redevient actif. Ainsi, si on lit ce pseudo-fichier alors que le groupe de contrôle est inactif (idling), le rapport ne contiendra pas le temps passé à attendre dans l'état inactif (idling) actuel. Remarquer que ce rapport est uniquement disponible si <literal>CONFIG_DEBUG_BLK_CGROUP=y</literal> est installé sur le système.

source: reports the number of times requests for I/O operations by a cgroup were dequeued by specific devices. Entries have three fields: <replaceable>major</replaceable>, <replaceable>minor</replaceable>, and <replaceable>number</replaceable>. <replaceable>Major</replaceable> and <replaceable>minor</replaceable> are device types and node numbers specified in <citetitle>Linux Allocated Devices</citetitle>, and <replaceable>number</replaceable> is the number of requests the group was dequeued. Note that this report is available only if <literal>CONFIG_DEBUG_BLK_CGROUP=y</literal> is set on the system.
fr: rapporte le nombre de fois que des requêtes d'opérations d'E/S d'un groupe de contrôle ont été retirées des files d'attente par des périphériques spécifiques. Les entrées possèdent trois champs : <replaceable>majeur</replaceable>, <replaceable>mineur</replaceable> et <replaceable>nombre</replaceable>. <replaceable>Majeur</replaceable> et <replaceable>mineur</replaceable> sont les types de périphérique et numéros de noeud spécifiés dans les <citetitle>périphériques alloués de Linux</citetitle> et <replaceable>nombre</replaceable> est le nombre de requêtes que le groupe a retiré de la file d'attente. Remarquer que ce rapport est uniquement disponible si <literal>CONFIG_DEBUG_BLK_CGROUP=y</literal> est installé sur le système.

source: I/O Throttling Configuration Options
fr: Options de configuration de limitation des entrées/sorties

source: specifies the upper limit on the number of <emphasis>read</emphasis> operations a device can perform. The rate of the <emphasis>read</emphasis> operations is specified in bytes per second. Entries have three fields: <replaceable>major</replaceable>, <replaceable>minor</replaceable>, and <replaceable>bytes_per_second</replaceable>. <replaceable>Major</replaceable> and <replaceable>minor</replaceable> are device types and node numbers specified in <citetitle>Linux Allocated Devices</citetitle>, and <replaceable>bytes_per_second</replaceable> is the upper limit rate at which <emphasis>read</emphasis> operations can be performed. For example, to allow the <filename>/dev/sda</filename> device to perform <emphasis>read</emphasis> operations at a maximum of 10 MBps, run:
fr: spécifie la limite supérieure sur le nombre d'opérations en <emphasis>lecture</emphasis> que peut effectuer un périphérique. Le débit d'opérations en <emphasis>lecture</emphasis> est en octets par seconde. Les entrées possèdent trois champs : <replaceable>majeur</replaceable>, <replaceable>mineur</replaceable> et <replaceable>octets_par_secondes</replaceable>. <replaceable>Majeur</replaceable> et <replaceable>mineur</replaceable> sont les types de périphérique et numéros de noeud spécifiés dans les <citetitle>périphériques alloués de Linux</citetitle> et <replaceable>octets_par_secondes</replaceable> est la limite supérieure du débit à laquelle ont droit les opérations en <emphasis>lecture</emphasis>.Par exemple, pour autoriser le périphérique <filename>/dev/sda</filename> à effectuer des opérations en <emphasis>lecture</emphasis> à un débit maximum de 10 Mio/s, utiliser :

source: specifies the upper limit on the number of <emphasis>read</emphasis> operations a device can perform. The rate of the <emphasis>read</emphasis> operations is specified in operations per second. Entries have three fields: <replaceable>major</replaceable>, <replaceable>minor</replaceable>, and <replaceable>operations_per_second</replaceable>. <replaceable>Major</replaceable> and <replaceable>minor</replaceable> are device types and node numbers specified in <citetitle>Linux Allocated Devices</citetitle>, and <replaceable>operations_per_second</replaceable> is the upper limit rate at which <emphasis>read</emphasis> operations can be performed. For example, to allow the <filename>/dev/sda</filename> device to perform a maximum of 10 <emphasis>read</emphasis> operations per second, run:
fr: spécifie la limite supérieure sur le nombre d'opérations en <emphasis>lecture</emphasis> que peut effectuer un périphérique. Le débit d'opérations en <emphasis>lecture</emphasis> est en opérations par seconde. Les entrées possèdent trois champs : <replaceable>majeur</replaceable>, <replaceable>mineur</replaceable> et <replaceable>operations_par_secondes</replaceable>. <replaceable>Majeur</replaceable> et <replaceable>mineur</replaceable> sont les types de périphérique et numéros de noeud spécifiés dans les <citetitle>périphériques alloués de Linux</citetitle> et <replaceable>operations_par_secondes</replaceable> est la limite supérieure du nombre d'opérations en <emphasis>lecture</emphasis>.Par exemple, pour autoriser le périphérique <filename>/dev/sda</filename> à effectuer un maximum de 10 opérations en <emphasis>lecture</emphasis> par seconde, utiliser :

source: specifies the upper limit on the number of <emphasis>write</emphasis> operations a device can perform. The rate of the <emphasis>write</emphasis> operations is specified in bytes per second. Entries have three fields: <replaceable>major</replaceable>, <replaceable>minor</replaceable>, and <replaceable>bytes_per_second</replaceable>. <replaceable>Major</replaceable> and <replaceable>minor</replaceable> are device types and node numbers specified in <citetitle>Linux Allocated Devices</citetitle>, and <replaceable>bytes_per_second</replaceable> is the upper limit rate at which <emphasis>write</emphasis> operations can be performed. For example, to allow the <filename>/dev/sda</filename> device to perform <emphasis>write</emphasis> operations at a maximum of 10 MBps, run:
fr: spécifie la limite supérieure sur le nombre d'opérations en <emphasis>écriture</emphasis> que peut effectuer un périphérique. Le débit d'opérations en <emphasis>écriture</emphasis> est en octets par seconde. Les entrées possèdent trois champs : <replaceable>majeur</replaceable>, <replaceable>mineur</replaceable> et <replaceable>octets_par_secondes</replaceable>. <replaceable>Majeur</replaceable> et <replaceable>mineur</replaceable> sont les types de périphérique et numéros de noeud spécifiés dans les <citetitle>périphériques alloués de Linux</citetitle> et <replaceable>octets_par_secondes</replaceable> est la limite supérieure du débit à laquelle ont droit les opérations en <emphasis>écriture</emphasis>.Par exemple, pour autoriser le périphérique <filename>/dev/sda</filename> à effectuer des opérations en <emphasis>écriture</emphasis> à un débit maximum de 10 Mio/s, utiliser :

source: specifies the upper limit on the number of <emphasis>write</emphasis> operations a device can perform. The rate of the <emphasis>write</emphasis> operations is specified in operations per second. Entries have three fields: <replaceable>major</replaceable>, <replaceable>minor</replaceable>, and <replaceable>operations_per_second</replaceable>. <replaceable>Major</replaceable> and <replaceable>minor</replaceable> are device types and node numbers specified in <citetitle>Linux Allocated Devices</citetitle>, and <replaceable>operations_per_second</replaceable> is the upper limit rate at which <emphasis>read</emphasis> operations can be performed. For example, to allow the <filename>/dev/sda</filename> device to perform a maximum of 10 <emphasis>write</emphasis> operations per second, run:
fr: spécifie la limite supérieure sur le nombre d'opérations en <emphasis>écriture</emphasis> que peut effectuer un périphérique. Le débit d'opérations en <emphasis>écriture</emphasis> est en opérations par seconde. Les entrées possèdent trois champs : <replaceable>majeur</replaceable>, <replaceable>mineur</replaceable> et <replaceable>operations_par_secondes</replaceable>. <replaceable>Majeur</replaceable> et <replaceable>mineur</replaceable> sont les types de périphérique et numéros de noeud spécifiés dans les <citetitle>périphériques alloués de Linux</citetitle> et <replaceable>operations_par_secondes</replaceable> est la limite supérieure du nombre d'opérations en <emphasis>écriture</emphasis>.Par exemple, pour autoriser le périphérique <filename>/dev/sda</filename> à effectuer un maximum de 10 opérations en <emphasis>écriture</emphasis> par seconde, utiliser :

source: reports the number of I/O operations performed on specific devices by a cgroup as seen by the throttling policy. Entries have four fields: <replaceable>major</replaceable>, <replaceable>minor</replaceable>, <replaceable>operation</replaceable>, and <replaceable>number</replaceable>. <replaceable>Major</replaceable> and <replaceable>minor</replaceable> are device types and node numbers specified in <citetitle>Linux Allocated Devices</citetitle>, <replaceable>operation</replaceable> represents the type of operation (<literal>read</literal>, <literal>write</literal>, <literal>sync</literal>, or <literal>async</literal>) and <replaceable>number</replaceable> represents the number of operations.
fr: rapporte le nombre d'opérations d'E/S effectuées sur des périphériques spécifiques par un groupe de contrôle comme vu par la politique de limitation. Les entrées possèdent quatre champs : <replaceable>majeur</replaceable>, <replaceable>mineur</replaceable>, <replaceable>opération</replaceable> et <replaceable>octets</replaceable>. <replaceable>Majeur</replaceable> et <replaceable>mineur</replaceable> sont les types de périphériques et numéros de noeuds spécifiés dans les <citetitle>périphériques alloués de Linux</citetitle>, <replaceable>opération</replaceable> représente le type d'opération (<literal>lecture</literal>, <literal>écriture</literal>, <literal>sync</literal> ou <literal>async</literal>) et <replaceable>nombre</replaceable> représente le nombre d'opérations.

source: reports the number of bytes transferred to or from specific devices by a cgroup. The only difference between <parameter>blkio.io_service_bytes</parameter> and <parameter>blkio.throttle.io_service_bytes</parameter> is that the former is not updated when the CFQ scheduler is operating on a request queue. Entries have four fields: <replaceable>major</replaceable>, <replaceable>minor</replaceable>, <replaceable>operation</replaceable>, and <replaceable>bytes</replaceable>. <replaceable>Major</replaceable> and <replaceable>minor</replaceable> are device types and node numbers specified in <citetitle>Linux Allocated Devices</citetitle>, <replaceable>operation</replaceable> represents the type of operation (<literal>read</literal>, <literal>write</literal>, <literal>sync</literal>, or <literal>async</literal>) and <replaceable>bytes</replaceable> is the number of bytes transferred.
fr: rapporte le nombre d'octets transférés depuis ou vers des périphériques spécifiques par un groupe de contrôle. La seule différence entre <parameter>blkio.io_service_bytes</parameter> et <parameter>blkio.throttle.io_service_bytes</parameter> tient au fait que le premier n'est pas mis à jour quand l'ordonnanceur CFQ opère sur une file d'attente. Les entrées possèdent quatre champs : <replaceable>majeur</replaceable>, <replaceable>mineur</replaceable>, <replaceable>opération</replaceable> et <replaceable>octets</replaceable>. <replaceable>Majeur</replaceable> et <replaceable>mineur</replaceable> sont les types de périphériques et des numéros de noeuds spécifiés dans les <citetitle>périphériques alloués de Linux</citetitle>, <replaceable>opération</replaceable> représente le type d'opération (<literal>lecture</literal>, <literal>écriture</literal>, <literal>sync</literal> ou <literal>async</literal>) et <replaceable>octets</replaceable> est le nombre d'octets transférés.

source: Common Configuration Option
fr: Options de configuration courantes

source: The following configuration option may be used for either of the policies listed in <xref linkend="sec-blkio" />.
fr: L'option de configuration suivante peut être utilisée pour l'une ou l'autre des politiques listées dans <xref linkend="sec-blkio" />.

source: resets the statistics recorded in the other pseudofiles. Write an integer to this file to reset the statistics for this cgroup.
fr: réinitialise les statistiques enregistrées dans les autres pseudo-fichiers. Écrire un nombre entier dans ce fichier pour réinitialiser les statistiques de ce groupe de contrôle.

source: Example Usage
fr: Exemples d'utilisation

source: Refer to <xref linkend="ex-blkio_usage" /> for a simple test of running two <command>dd</command> threads in two different cgroups with various <filename>blkio.weight</filename> values.
fr: Se reporter à <xref linkend="ex-blkio_usage" /> pour un test simple utilisant l'exécution de deux fils <command>dd</command> dans deux cgroups différents avec des valeurs <filename>blkio.weight</filename> variées.

source: blkio proportional weight division
fr: répartition proportionnelle pondérée blkio

source: Mount the <systemitem class="resource">blkio</systemitem> subsystem:
fr: Monter le sous-système <systemitem class="resource">blkio</systemitem> :

source: ~]# <command>mount -t cgroup -o blkio blkio /cgroup/blkio/</command>
fr: ~]#&nbsp;<command>mount -t cgroup -o blkio blkio /cgroup/blkio/</command>

source: Create two cgroups for the <systemitem class="resource">blkio</systemitem> subsystem:
fr: Créer deux cgroups pour le sous-système <systemitem class="resource">blkio</systemitem> :

source: Set various <systemitem class="resource">blkio</systemitem> weights in the previously-created cgroups:
fr: Définir différentes pondérations <systemitem class="resource">blkio</systemitem> dans le cgroup précédemment créé :

source: Create two large files:
fr: Créer deux fichiers de grande taille :

source: The above commands create two files (<filename>file_1</filename> and <filename>file_2</filename>) of size 4 GB.
fr: Les commandes ci-dessus créent deux fichiers (<filename>file_1</filename> et <filename>file_2</filename>) de 4 Gio de taille.

source: For each of the test cgroups, execute a <command>dd</command> command (which reads the contents of a file and outputs it to the null device) on one of the large files:
fr: Pour chaque cgroups de test, lancer une commande <command>dd</command> (qui lit le contenu d'un fichier et l'envoie en sortie sur le périphérique null) sur l'un des les fichiers de grande taille :

source: Both commands will output their completion time once they have finished.
fr: Les deux commandes indiqueront leur durée d'exécution dès qu'elles auront terminé.

source: Simultaneously with the two running <command>dd</command> threads, you can monitor the performance in real time by using the <application>iotop</application> utility. To install the <application>iotop</application> utility, execute, as root, the <command>yum install iotop</command> command. The following is an example of the output as seen in the <application>iotop</application> utility while running the previously-started <command>dd</command> threads:
fr: Simultanément à l'exécution des deux commandes <command>dd</command>, on peut surveiller les performances en temps réel en utilisant l'utilitaire <application>iotop</application>. Pour installer cet utilitaire <application>iotop</application>, exécuter en tant que root la commande <command>yum install iotop</command>. Ce qui suit est un exemple de la sortiede l'utilitaire <application>iotop</application> pendant l'exécution des commandes <command>dd</command> lancées précédemment :

source: In order to get the most accurate result in <xref linkend="ex-blkio_usage" />, prior to the execution of the <command>dd</command> commands, flush all file system buffers and free pagecache, dentries and inodes using the following commands:
fr: Afin d'obtenir le résultat le plus précis possible dans <xref linkend="ex-blkio_usage" />, il faut avant de lancer les commandes <command>dd</command> vider tous les tampons du système de fichiers et libérer les caches de pages, d'entrées de répertoire et de nœuds en utilisant la commande suivante :

source: Additionally, you can enable <firstterm>group isolation</firstterm> which provides stronger isolation between groups at the expense of throughput. When group isolation is disabled, fairness can be expected only for a sequential workload. By default, group isolation is enabled and fairness can be expected for random I/O workloads as well. To enable group isolation, use the following command:
fr: En outre, il est possible d'activer l'<firstterm>isolement de groupe</firstterm> quioffre un meilleur isolement entre les groupes au détriment du débit.Lorsque l'isolement de groupe est désactivé, l'équité ne peut être attendu que pour une charge de travail séquentielle. Par défaut, l'isolement de groupe est activé et l'équité peut aussi être attendue pour des aléatoires charges de travail d'entrées/sorties aléatoires. Pour activer l'isolement du groupe,utiliser la commande suivante :

source: where <replaceable>&lt;disk_device&gt;</replaceable> stands for the name of the desired device, for example <systemitem>sda</systemitem>.
fr: où <replaceable>&lt;disk_device&gt;</replaceable> est le nom du périphérique voulu, par exemple <systemitem>sda</systemitem>.

source: The <systemitem>cpu</systemitem> subsystem schedules CPU access to cgroups. Access to CPU resources can be scheduled according to the following parameters, each one in a separate <firstterm>pseudofile</firstterm> within the cgroup virtual file system:
fr: Le sous-système <systemitem>cpu</systemitem> planifie l'accès du CPU aux groupes de contrôle. L'accès aux ressources CPU peut être planifié en fonction des paramètres suivants, chacun dans un fichier <firstterm>pseudofile</firstterm> (un pseudo-fichier) à l'intérieur du système de fichiers virtuels du groupe de contrôle :

source: contains an integer value that specifies a relative share of CPU time available to the tasks in a cgroup. For example, tasks in two cgroups that have <filename>cpu.shares</filename> set to <literal>1</literal> will receive equal CPU time, but tasks in a cgroup that has <filename>cpu.shares</filename> set to <literal>2</literal> receive twice the CPU time of tasks in a cgroup where <filename>cpu.shares</filename> is set to <literal>1</literal>.
fr: contient une valeur entière spécifiant une part relative du temps du CPU disponible pour les tâches dans un groupe de contrôle (un cgroup). Par exemple, des tâches dans deux groupes de contrôle possédant <filename>cpu.shares</filename> paramétré sur <literal>1</literal> recevront le même temps de CPU, mais des tâches dans un groupe de contrôle possédant <filename>cpu.shares</filename> paramétré sur <literal>2</literal> recevront deux fois plus de temps de CPU que les tâches où <filename>cpu.shares</filename> est paramétré sur <literal>1</literal>.

source: applicable to realtime scheduling tasks only, this parameter specifies a period of time in microseconds (µs, represented here as "<parameter>us</parameter>") for the longest continuous period in which the tasks in a cgroup have access to CPU resources. Establishing this limit prevents tasks in one cgroup from monopolizing CPU time. If the tasks in a cgroup should be able to access CPU resources for 4 seconds out of every 5 seconds, set <filename>cpu.rt_runtime_us</filename> to <literal>4000000</literal> and <filename>cpu.rt_period_us</filename> to <literal>5000000</literal>.
fr: applicables aux seules tâches gérées par l'ordonnanceur temps-réel, ce paramètre spécifie une période de temps en microsecondes (µs, représenté ici sous la forme "us") pour la plus longue période continue pendant laquelle les tâches d'un groupe de contrôle ont accès aux ressources du CPU. Établir cette limite permet d'empêcher les tâches d'un groupe de contrôle de monopoliser le temps du CPU. Si les tâches dans un groupe de contrôle doivent pouvoir accéder aux ressources du CPU pendant 4 secondes sur chaque période de 5 secondes, ajuster <filename>cpu.rt_runtime_us</filename> sur <literal>4000000</literal> et <filename>cpu.rt_period_us</filename> sur <literal>5000000</literal>.
