Repository: jfenal-zz/fedora-trans-fr
Catalog: for_translation_resource-management-guide_Using_Control_Groups_*.po
Languages: fr

source: Using Control Groups
fr: Utiliser les groupes de contrôle

source: The easiest way to work with cgroups is to install the <package>libcgroup-tools</package> package, which contains a number of cgroup-related command line utilities and their associated man pages. It is possible to <firstterm>mount</firstterm> hierarchies and set cgroup parameters (non-persistently) using shell commands and utilities available on any system. However, using the <package>libcgroup-tools</package>-provided utilities simplifies the process and extends your capabilities. Therefore, this guide focuses on <package>libcgroup-tools</package> commands throughout. In most cases, we have included the equivalent shell commands to help describe the underlying mechanism. However, we recommend that you use the <package>libcgroup-tools</package> commands wherever practical.
fr: La manière la plus simple de travailler avec cgroups est d'installer le paquetage <package>libcgroup-tools</package>, qui contient bon nombre d'utilitaires en ligne de commande relatives à cgroups ainsi les pages de manuels associées. Il est possible de monter avec <firstterm>mount</firstterm> des hiérarchies et de configurer de manière volatile les parameètres cgroup avec des commandes shells et les utilitaires disponibles sur tout système. Néanmoins, l'utilisation des utilitaires fournis par le paquetage <package>libcgroup-tools</package> simplifie le processus et augmente vos possibilités. Ainsi, ce guide se concentre sur les commandes de <package>libcgroup-tools</package>. Dans la plupart des cas, l'équivalent en commandes shell est indiqué de façon à aider à la description du mécanisme sous-jacent. Il est cependant recommandé d'utiliser les commandes de <package>libcgroup-tools</package> autant que faire se peut.

source: Installing the libcgroup-tools package
fr: Installation du paquetage libcgroup-tools

source: In order to use cgroups, first ensure the <package>libcgroup-tools</package> package is installed on your system by running, as root:
fr: Avant de pouvoir utiliser cgroups, il faut s'assurer que le paquetage <package>libcgroup-tools</package> est installé sur votre système en lançant la commande qui suit en tant que root :

source: ~]# <command>yum install libcgroup-tools</command>
fr: ~]#&nbsp;<command>yum install libcgroup-tools</command>

source: The cgconfig Service
fr: Le service cgconfig

source: The <systemitem class="service">cgconfig</systemitem> service installed with the <package>libcgroup-tools</package> package provides a convenient way to create hierarchies, attach subsystems to hierarchies, and manage cgroups within those hierarchies. We recommend that you use <application>cgconfig</application> to manage hierarchies and cgroups on your system.
fr: Le service <systemitem class="service">cgconfig</systemitem> installé par le paquetage <package>libcgroup-tools</package> fournit un mécanisme pratique de créer les hiérarchies, d'attacher les sous-systèmes à ces hiérarchies, et de gérer les cgroups dans ces hiérarchies. Il est recommandé d'utiliser <application>cgconfig</application> pour la gestion des hiérarchies et des cgroups de votre système.

source: The <systemitem class="service">cgconfig</systemitem> service is not started by default on &MAJOROSVER;. When you start the service with <command>chkconfig</command>, it reads the cgroup configuration file — <filename>/etc/cgconfig.conf</filename>. Cgroups are therefore recreated from session to session and become persistent. Depending on the contents of the configuration file, <application>cgconfig</application> can create hierarchies, mount necessary file systems, create cgroups, and set subsystem parameters for each group.
fr: Le service <systemitem class="service">cgconfig</systemitem> n'est pas démarré par défaut sur &MAJOROSVER;. Quand ce service est démarré avec <command>chkconfig</command>, il lit le fichier de configuration cgroup — <filename>/etc/cgconfig.conf</filename>. Les cgroups sont ainsi recréés d'une session à l'autre et deviennent ainsi persistents. En fonction du contenu du fichier de configuration, <application>cgconfig</application> peut créer des hiérarchies, monter les systèmes de fichiers nécessaires, créer les cgroups, et positionner les paramètres de chaque groupe.

source: The default <filename>/etc/cgconfig.conf</filename> file installed with the <package>libcgroup-tools</package> package creates and mounts an individual hierarchy for each subsystem, and attaches the subsystems to these hierarchies.
fr: Le fichier <filename>/etc/cgconfig.conf</filename> par défaut installé avec le paquetage <package>libcgroup-tools</package> crée et monte les hiérarchies individuelles de chaque sous-système, et y attache les sous-systèmes.

source: If you stop the <systemitem class="service">cgconfig</systemitem> service (with the <command>systemctl stop cgconfig.service </command> command), it unmounts all the hierarchies that it mounted.
fr: Si l'on arrête le service <systemitem class="service">cgconfig</systemitem> (avec la commande <command>systemctl stop cgconfig</command>), celui-ci démontera toutes les hiérarchies qu'il avait monté.

source: The /etc/cgconfig.conf File
fr: Le fichier /etc/cgconfig.conf

source: The <filename>/etc/cgconfig.conf</filename> file contains two major types of entry — <firstterm>mount</firstterm> and <firstterm>group</firstterm>. Mount entries create and mount hierarchies as virtual file systems, and attach subsystems to those hierarchies. Mount entries are defined using the following syntax:
fr: Le fichier <filename>/etc/cgconfig.conf</filename> contient deux principaux types d'entrées — <firstterm>mount</firstterm> et <firstterm>group</firstterm>. Les entrées « mount » créent et montent les hiérarchies en tant que systèmes de fichiers virtuels et attachent les sous-systèmes à ces hiérarchies. Les entrées « mount » sont définies à l'aide de la syntaxe suivante :

source: See <xref linkend="example-mount-entry" /> for an example usage.
fr: Voir l'<xref linkend="example-mount-entry" /> pour un exemple d'utilisation.

source: Creating a mount entry
fr: Création d'une entrée « mount »

source: The following example creates a hierarchy for the <systemitem>cpuset</systemitem> subsystem:
fr: L'exemple suivant crée une hiérarchie pour le sous-système <systemitem>cpuset</systemitem> :

source: the equivalent of the shell commands:
fr: équivaut aux commandes shell :

source: ~]# <command>mkdir /cgroup/red</command> ~]# <command>mount -t cgroup -o cpuset red /cgroup/red</command>
fr: ~]#&nbsp;<command>mkdir /cgroup/red</command> ~]#&nbsp;<command>mount -t cgroup -o cpuset red /cgroup/red</command>

source: Group entries create cgroups and set subsystem parameters. Group entries are defined using the following syntax:
fr: Les entrées « group » créent des groupes de contrôle et définissent les paramètres des sous-systèmes. Les entrées « group » sont définies à l'aide de la syntaxe suivante :

source: Note that the <literal>permissions</literal> section is optional. To define permissions for a group entry, use the following syntax:
fr: Remarquer que la section <literal>permissions</literal> est optionnelle. Pour définir les permissions pour une entrée « group », utiliser la syntaxe suivante :

source: See <xref linkend="example-group-entry" /> for example usage:
fr: Voir l'<xref linkend="example-group-entry" /> pour un exemple d'utilisation :

source: Creating a group entry
fr: Création d'une entrée « group »

source: The following example creates a cgroup for SQL daemons, with permissions for users in the <literal>sqladmin</literal> group to add tasks to the cgroup and the <literal>root</literal> user to modify subsystem parameters:
fr: L'exemple suivant crée un cgroup pour les démons SQL, autorisant les utilisateurs du groupe <literal>sqladmin</literal> à ajouter des tâches au cgroup et l'utilisateur root à modifier les paramètres des sous-systèmes.

source: When combined with the example of the mount entry in <xref linkend="example-mount-entry" />, the equivalent shell commands are:
fr: Lorsqu'elles sont combinées avec l'exemple de l'entrée « mount » dans <xref linkend="example-mount-entry" />, les commandes shell équivalentes sont :

source: Restart the cgconfig service for the changes to take effect
fr: Redémarrer le service cgconfig pour prendre en compte les modifications

source: You must restart the <systemitem class="service">cgconfig</systemitem> service for the changes in the <filename>/etc/cgconfig.conf</filename> to take effect:
fr: Il faut redémarrer le service <systemitem class="service">cgconfig</systemitem> pour que les changements dans <filename>/etc/cgconfig.conf</filename> prennent effet :

source: ~]# <command>systemctl restart cgconfig.service </command>
fr: ~]#&nbsp;<command>systemctl restart cgconfig.service </command>

source: When you install the <package>libcgroup-tools</package> package, a sample configuration file is written to <filename>/etc/cgconfig.conf</filename>. The hash symbols ('<literal>#</literal>') at the start of each line comment that line out and make it invisible to the <systemitem class="service">cgconfig</systemitem> service.
fr: Lors de l'installation du paquetage <package>libcgroup-tools</package>, un exemple de fichier de configuration est mis à disposition sous le nom <filename>/etc/cgconfig.conf</filename>. Le symbole <literal>#</literal> en début de ligne indique un commentaire, et rend ces lignes invisibles au service <systemitem class="service">cgconfig</systemitem>.

source: Creating a Hierarchy and Attaching Subsystems
fr: Créer une hiérarchie et attacher des sous-systèmes

source: Effects on running systems
fr: Effets sur les systèmes en cours d'exécution

source: The following instructions, which cover creating a new hierarchy and attaching subsystems to it, assume that cgroups are not already configured on your system. In this case, these instructions will not affect the operation of the system. Changing the tunable parameters in a cgroup with tasks, however, may immediately affect those tasks. This guide alerts you the first time it illustrates changing a tunable cgroup parameter that may affect one or more tasks.
fr: Les instructions suivantes, qui couvrent la création d'une nouvelle hiérarchie et comment y attacher des sous-systèmes, suppose que les groupes de contrôle ne sont pas encore configurés sur votre système. Dans ce cas, ces instructions n'affecteront pas l'opération du système. La modification de paramètres réglables dans un groupe de contrôle avec des tâches pourrait cependant affecter ces tâches immédiatement. Ce guide vous prévient la première fois qu'il illustre la modification d'un paramètre de groupe de contrôle réglable qui pourrait affecter une ou plusieurs tâches.

source: On a system on which cgroups are already configured (either manually, or by the <systemitem class="service">cgconfig</systemitem> service) these commands will fail unless you first unmount existing hierarchies, which will affect the operation of the system. Do not experiment with these instructions on production systems.
fr: Ces commandes échoueront sur un système où les groupes de contrôle sont déjà configurés (manuellement ou par le service <systemitem class="service">cgconfig</systemitem>), à moins de d'abord démonter les hiérarchies existantes, ce qui affectera l'opération du système. Ne pas expérimenter ces instructions sur des systèmes de production.

source: To create a hierarchy and attach subsystems to it, edit the <literal>mount</literal> section of the <filename>/etc/cgconfig.conf</filename> file as root. Entries in the <literal>mount</literal> section have the following format:
fr: Pour créer un hiérarchie et y attacher des sous-systèmes, modifier la section <literal>mount</literal> du fichier <filename>/etc/cgconfig.conf</filename> en tant que super-utilisateur. Les entrées de la section <literal>mount</literal> sont sous le format suivant :

source: When <systemitem class="service">cgconfig</systemitem> next starts, it will create the hierarchy and attach the subsystems to it.
fr: Lorsque <systemitem class="service">cgconfig</systemitem> redémarrera, il créera la hiérarchie et y attachera les sous-systèmes.

source: The following example creates a hierarchy called <systemitem>cpu_and_mem</systemitem> and attaches the <systemitem>cpu</systemitem>, <systemitem>cpuset</systemitem>, <systemitem>cpuacct</systemitem>, and <systemitem>memory</systemitem> subsystems to it.
fr: L'exemple suivant crée une hiérarchie nommée <systemitem>cpu_and_mem</systemitem> et y attache les sous-systèmes <systemitem>cpu</systemitem>, <systemitem>cpuset</systemitem>, <systemitem>cpuacct</systemitem> et <systemitem>memory</systemitem>.

source: Alternative method
fr: Variante

source: You can also use shell commands and utilities to create hierarchies and attach subsystems to them.
fr: Il est aussi possible d'utiliser des commandes shell et des utilitaires pour créer des hiérarchies et leur attacher des sous-systèmes.

source: Create a <firstterm>mount point</firstterm> for the hierarchy as root. Include the name of the cgroup in the mount point:
fr: Créer un <firstterm>point de montage</firstterm> pour la hiérarchie en tant que super-utilisateur. Inclure le nom du groupe de contrôle dans le point de montage :

source: For example:
fr: Par exemple :

source: Next, use the <command>mount</command> command to mount the hierarchy and simultaneously attach one or more subsystems. For example:
fr: Puis utiliser la commande <command>mount</command> pour monter la hiérarchie et y attacher un ou plusieurs sous-systèmes simultanément. Par exemple :

source: Where <replaceable>subsystems</replaceable> is a comma-separated list of subsystems and <replaceable>name</replaceable> is the name of the hierarchy. Brief descriptions of all available subsystems are listed in <xref linkend="Available_Subsystems" />, and <xref linkend="ch-Subsystems_and_Tunable_Parameters" /> provides a detailed reference.
fr: Où <replaceable>subsystems</replaceable> est une liste des sous-systèmes séparés par virgules et <replaceable>name</replaceable> est le nom de la hiérarchie. De brèves descriptions de tous les sous-systèmes disponibles sont répertoriées dans les <xref linkend="Available_Subsystems" /> et le lien <xref linkend="ch-Subsystems_and_Tunable_Parameters" /> fournit une référence détaillée.

source: Using the mount command to attach subsystems
fr: Utilisation de la commande mount pour attacher des sous-systèmes

source: In this example, a directory named <filename>/cgroup/cpu_and_mem</filename> already exists, which will serve as the mount point for the hierarchy that we create. We will attach the <systemitem class="resource">cpu</systemitem>, <systemitem class="resource">cpuset</systemitem> and <systemitem class="resource">memory</systemitem> subsystems to a hierarchy we name <systemitem class="groupname">cpu_and_mem</systemitem>, and <command>mount</command> the <systemitem class="groupname">cpu_and_mem</systemitem> hierarchy on <filename>/cgroup/cpu_and_mem</filename>:
fr: Dans cet exemple, un répertoire nommé <filename>/cgroup/cpu_and_mem</filename>, qui sert de point de montage pour la hiérarchie en cours de création, existe déjà. Y attacher les sous-systèmes <systemitem class="resource">cpu</systemitem>, <systemitem class="resource">cpuset</systemitem> et <systemitem class="resource">memory</systemitem> à une hiérarchie qui sera nommée <systemitem class="groupname">cpu_and_mem</systemitem>, puis monter (<command>mount</command>) la hiérarchie <systemitem class="groupname">cpu_and_mem</systemitem> sur <filename>/cgroup/cpu_and_mem</filename> :

source: You can list all available subsystems along with their current mount points (i.e. where the hierarchy they are attached to is mounted) with the <command>lssubsys</command> <footnote id="footnote-lssubsys_is_provided_by_libcgroup"> <para>The <command>lssubsys</command> command is one of the utilities provided by the <package>libcgroup-tools</package> package. You must install <package>libcgroup-tools</package> to use it: refer to <xref linkend="ch-Using_Control_Groups" /> if you are unable to run <command>lssubsys</command>.</para> </footnote> command:
fr: Il est possible de lister tous les sous-systèmes disponibles ainsi que leurs points de montage respectifs (c'est à dire l'endroit où la hiérarchie à laquelle ils sont attachés est montée) avec la commande <command>lssubsys</command> <footnote id="footnote-lssubsys_is_provided_by_libcgroup">. <para>La commande <command>lssubsys</command> est l'un des utilitaires fournis par le paquetage <package>libcgroup-tools</package>. Il faut installer <package>libcgroup-tools</package> afin de pouvoir l'utiliser : cf. <xref linkend="ch-Using_Control_Groups" /> s'il est impossible d'utiliser la commande <command>lssubsys</command>.</para> </footnote> :

source: This output indicates that:
fr: Cette sortie indique que :

source: the <systemitem class="resource">cpu</systemitem>, <systemitem class="resource">cpuset</systemitem> and <systemitem class="resource">memory</systemitem> subsystems are attached to a hierarchy mounted on <filename>/cgroup/cpu_and_mem</filename>, and
fr: les sous-systèmes <systemitem class="resource">cpu</systemitem>, <systemitem class="resource">cpuset</systemitem> et <systemitem class="resource">memory</systemitem> sont attachés à une hiérarchie montée sur <filename>/cgroup/cpu_and_mem</filename>.

source: the <systemitem class="resource">net_cls</systemitem>, <systemitem class="resource">ns</systemitem>, <systemitem class="resource">cpuacct</systemitem>, <systemitem class="resource">devices</systemitem>, <systemitem class="resource">freezer</systemitem> and <systemitem class="resource">blkio</systemitem> subsystems are as yet unattached to any hierarchy, as illustrated by the lack of a corresponding mount point.
fr: les sous-systèmes <systemitem class="resource">net_cls</systemitem>, <systemitem class="resource">ns</systemitem>, <systemitem class="resource">cpuacct</systemitem>, <systemitem class="resource">devices</systemitem>, <systemitem class="resource">freezer</systemitem> et <systemitem class="resource">blkio</systemitem> ne sont toujours pas attachés à une hiérarchie, comme l'absence de point de montage le montre.

source: Attaching Subsystems to, and Detaching Them From, an Existing Hierarchy
fr: Attacher et détacher des sous-systèmes d'une hiérarchie existante

source: To add a subsystem to an existing hierarchy, detach it from an existing hierarchy, or move it to a different hierarchy, edit the <literal>mount</literal> section of the <filename>/etc/cgconfig.conf</filename> file as root, using the same syntax described in <xref linkend="sec-Creating_a_Hierarchy_and_Attaching_Subsystems" />. When <systemitem class="service">cgconfig</systemitem> next starts, it will reorganize the subsystems according to the hierarchies that you specify.
fr: Pour ajouter ou détacher un sous-système à une hiérarchie existante, ou bien pour le déplacer sur une autre hiérarchie, modifier la section <literal>mount</literal> du fichier <filename>/etc/cgconfig.conf</filename> en tant que super-utilisateur en utilisant la même syntaxe que celle décrite dans la <xref linkend="sec-Creating_a_Hierarchy_and_Attaching_Subsystems" />. La prochaine fois que <systemitem class="service">cgconfig</systemitem> démarrera, il réorganisera les sous-systèmes en fonction des hiérarchies spécifiées.

source: To add an unattached subsystem to an existing hierarchy, remount the hierarchy. Include the extra subsystem in the <command>mount</command> command, together with the <option>remount</option> option.
fr: Pour ajouter un sous-système non attaché à une hiérarchie existante, remonte la hiérarchie. Inclure le sous-système supplémentaire dans la commande <command>mount</command> ainsi que l'option <option>remount</option>.

source: Remounting a hierarchy to add a subsystem
fr: Monter une hiérarchie à nouveau pour ajouter un sous-système

source: The <command>lssubsys</command> command shows <systemitem>cpu</systemitem>, <systemitem>cpuset</systemitem>, and <systemitem>memory</systemitem> subsystems attached to the <systemitem>cpu_and_mem</systemitem> hierarchy:
fr: La commande <command>lssubsys</command> affiche les sous-systèmes <systemitem>cpu</systemitem>, <systemitem>cpuset</systemitem> et <systemitem>memory</systemitem>, qui sont attachés à la hiérarchie <systemitem>cpu_and_mem</systemitem> :

source: We remount the <systemitem>cpu_and_mem</systemitem> hierarchy, using the <option>remount</option> option, and including <systemitem>cpuacct</systemitem> in the list of subsystems:
fr: Montons à nouveau la hiérarchie <systemitem>cpu_and_mem</systemitem>, en utilisant l'option <option>remount</option> tout en incluant <systemitem>cpuacct</systemitem> dans la liste des sous-systèmes :

source: The <command>lssubsys</command> command now shows <systemitem>cpuacct</systemitem> attached to the <systemitem>cpu_and_mem</systemitem> hierarchy:
fr: La commande <command>lssubsys</command> affiche maintenant que <systemitem>cpuacct</systemitem> est attaché à la hiérarchie <systemitem>cpu_and_mem</systemitem> :

source: Analogously, you can detach a subsystem from an existing hierarchy by remounting the hierarchy and omitting the subsystem name from the -o options. For example, to then detach the <systemitem class="resource">cpuacct</systemitem> subsystem, simply remount and omit it:
fr: De manière analogue, il est possible de détacher un sous-système d'une hiérarchie existante en montant la hiérarchie à nouveau sans mentionner le nom du sous-système dans les options -o. Par exemple, pour détacher le sous-système <systemitem class="resource">cpuacct</systemitem>, faites un nouveau montage sans le déclarer :

source: Unmounting a Hierarchy
fr: Démonter une hiérarchie

source: You can <firstterm>unmount</firstterm> a hierarchy of cgroups with the <command>umount</command> command:
fr: Il est possible de <firstterm>démonter</firstterm> (<firstterm>unmount</firstterm>) une hiérarchie de groupes de contrôle avec la commande <command>umount</command> :

source: If the hierarchy is currently empty (that is, it contains only the root cgroup) the hierarchy is deactivated when it is unmounted. If the hierarchy contains any other cgroups, the hierarchy remains active in the kernel even though it is no longer mounted.
fr: Si la hiérarchie est actuellement vide (c'est-à-dire si elle ne contient que le groupe de contrôle racine), celle-ci sera désactivée lors de son démontage. Si la hiérarchie contient un quelconque groupe de contrôle, alors elle restera active dans le noyau même si elle n'est plus montée.

source: To remove a hierarchy, ensure that all child cgroups are removed before you unmount the hierarchy, or use the <command>cgclear</command> command which can deactivate a hierarchy even when it is not empty — refer to <xref linkend="Unloading_Control_Groups" />.
fr: Pour supprimer une hiérarchie, s'assurer que tous les groupes de contrôle enfants sont supprimés avant de la démonter, ou utiliser la commande <command>cgclear</command>, qui désactive une hiérarchie même si celle-ci n'est pas vide — se reporter à la <xref linkend="Unloading_Control_Groups" />.

source: Creating Control Groups
fr: Création de groupes de contrôle

source: Use the <command>cgcreate</command> command to create cgroups. The syntax for <command>cgcreate</command> is:
fr: Utiliser la commande <command>cgcreate</command> pour créer les cgroups. La syntaxe de <command>cgcreate</command> en est :

source: where:
fr: où :
