Repository: jfenal-zz/fedora-trans-fr
Catalog: for_translation_resource-management-guide_Subsystems_and_Tunable_Parameters_*.po
Languages: fr

source: <literal>FROZEN</literal> — tasks in the cgroup are suspended.
fr: <literal>FROZEN</literal> — les tâches dans le groupe de contrôle sont suspendues.

source: <literal>FREEZING</literal> — the system is in the process of suspending tasks in the cgroup.
fr: <literal>FREEZING</literal> — le système est en train de suspendre les tâches dans le groupe de contrôle.

source: <literal>THAWED</literal> — tasks in the cgroup have resumed.
fr: <literal>THAWED</literal> — les tâches dans le groupe de contrôle sont réactivées.

source: To suspend a specific process:
fr: Pour suspendre un processus spécifique :

source: Move that process to a cgroup in a hierarchy which has the <systemitem class="resource">freezer</systemitem> subsystem attached to it.
fr: Déplacer ce processus dans un groupe de contrôle se trouvant dans une hiérarchie à laquelle le sous-système <systemitem class="resource">freezer</systemitem> est attaché.

source: Freeze that particular cgroup to suspend the process contained in it.
fr: Geler ce groupe de contrôle en particulier pour suspendre le processus qu'il contient.

source: It is not possible to move a process into a suspended (frozen) cgroup.
fr: Il n'est pas possible de déplacer un processus dans un groupe de contrôle suspendu (frozen).

source: Note that while the <literal>FROZEN</literal> and <literal>THAWED</literal> values can be written to <filename>freezer.state</filename>, <literal>FREEZING</literal> cannot be written, only read.
fr: Remarquer que les valeurs <literal>FROZEN</literal> et <literal>THAWED</literal> peuvent être écrites sur <filename>freezer.state</filename>, alors que <literal>FREEZING</literal> peut seulement être lu.

source: memory
fr: mémoire

source: The <systemitem>memory</systemitem> subsystem generates automatic reports on memory resources used by the tasks in a cgroup, and sets limits on memory use by those tasks:
fr: Le sous-système <systemitem>mémoire</systemitem> génère des rapports automatiques sur les ressources mémoire utilisées par les tâches dans un groupe de contrôle. Il définit aussi les limites d'utilisation de mémoire de ces tâches :

source: reports a wide range of memory statistics, as described in the following table:
fr: rapporte un large éventail de statistiques de mémoire, comme décrit dans le tableau suivant :

source: Values reported by memory.stat
fr: Les valeurs rapportées par memory.stat

source: Statistic
fr: Statistique

source: page cache, including <systemitem>tmpfs</systemitem> (<systemitem>shmem</systemitem>), in bytes
fr: cache de la page, inclut <systemitem>tmpfs</systemitem> (<systemitem>shmem</systemitem>), en octets

source: anonymous and swap cache, <emphasis>not</emphasis> including <systemitem>tmpfs</systemitem> (<systemitem>shmem</systemitem>), in bytes
fr: caches swap et anonyme, <emphasis>n'inclut pas</emphasis> <systemitem>tmpfs</systemitem> (<systemitem>shmem</systemitem>), en octets

source: size of memory-mapped mapped files, including <systemitem>tmpfs</systemitem> (<systemitem>shmem</systemitem>), in bytes
fr: taille des fichiers mappé en mémoire, inclut <systemitem>tmpfs</systemitem> (<systemitem>shmem</systemitem>), en octets

source: number of pages paged into memory
fr: nombre de pages chargées en mémoire

source: number of pages paged out of memory
fr: nombre de pages renvoyées de la mémoire

source: swap usage, in bytes
fr: usage swap, en octets

source: anonymous and swap cache on active least-recently-used (LRU) list, including <systemitem>tmpfs</systemitem> (<systemitem>shmem</systemitem>), in bytes
fr: caches swap et anonyme de la liste des LRU (dernier récemment utilisé) actifs, inclut <systemitem>tmpfs</systemitem> (<systemitem>shmem</systemitem>), en octets

source: anonymous and swap cache on inactive LRU list, including <systemitem>tmpfs</systemitem> (<systemitem>shmem</systemitem>), in bytes
fr: caches swap et anonyme de la liste des LRU (dernier récemment utilisé) inactifs, inclut <systemitem>tmpfs</systemitem> (<systemitem>shmem</systemitem>), en octets

source: file-backed memory on active LRU list, in bytes
fr: mémoire sauvegardée sur fichier de la liste des LRU actifs, en octets

source: file-backed memory on inactive LRU list, in bytes
fr: mémoire sauvegardée sur fichier de la liste des LRU inactifs, en octets

source: memory that cannot be reclaimed, in bytes
fr: mémoire ne pouvant pas être récupérée, en octets

source: memory limit for the hierarchy that contains the <systemitem>memory</systemitem> cgroup, in bytes
fr: limite de la mémoire pour la hiérarchie contenant le groupe de contrôle <systemitem>memory</systemitem>, en octets

source: memory plus swap limit for the hierarchy that contains the <systemitem>memory</systemitem> cgroup, in bytes
fr: limite de la mémoire plus le swap pour la hiérarchie contenant le groupe de contrôle <systemitem>memory</systemitem>, en octets

source: Additionally, each of these files other than <systemitem>hierarchical_memory_limit</systemitem> and <systemitem>hierarchical_memsw_limit</systemitem> has a counterpart prefixed <systemitem>total_</systemitem> that reports not only on the cgroup, but on all its children as well. For example, <systemitem>swap</systemitem> reports the swap usage by a cgroup and <systemitem>total_swap</systemitem> reports the total swap usage by the cgroup and all its child groups.
fr: En outre, à l'exception de <systemitem>hierarchical_memory_limit</systemitem> et de <systemitem>hierarchical_memsw_limit</systemitem>, tous les fichiers possèdent un préfixe <systemitem>total_</systemitem> qui effectue un rapport non seulement sur le groupe de contrôle, mais aussi sur ses enfants. Par exemple, <systemitem>swap</systemitem> rapporte l'utilisation du swap d'un groupe de contrôle et <systemitem>total_swap</systemitem> rapporte l'utilisation totale du swap du groupe de contrôle et de tous ses groupes enfants.

source: When you interpret the values reported by <systemitem>memory.stat</systemitem>, note how the various statistics inter-relate:
fr: Lorsque les valeurs rapportées par <systemitem>memory.stat</systemitem> doivent être interprétées, remarquer que les diverses statistiques sont reliées entres elles :

source: <systemitem>active_anon</systemitem> + <systemitem>inactive_anon</systemitem> = anonymous memory + file cache for <systemitem>tmpfs</systemitem> + swap cache
fr: <systemitem>active_anon</systemitem> + <systemitem>inactive_anon</systemitem> = mémoire anonyme + cache du fichier de <systemitem>tmpfs</systemitem> + cache du swap

source: Therefore, <systemitem>active_anon</systemitem> + <systemitem>inactive_anon</systemitem> ≠ <systemitem>rss</systemitem>, because <systemitem>rss</systemitem> does not include <systemitem>tmpfs</systemitem>.
fr: Ainsi, <systemitem>active_anon</systemitem> + <systemitem>inactive_anon</systemitem> ≠ <systemitem>rss</systemitem>, car <systemitem>rss</systemitem> n'inclut pas <systemitem>tmpfs</systemitem>.

source: <systemitem>active_file</systemitem> + <systemitem>inactive_file</systemitem> = cache - size of <systemitem>tmpfs</systemitem>
fr: <systemitem>active_file</systemitem> + <systemitem>inactive_file</systemitem> = cache - taille de <systemitem>tmpfs</systemitem>

source: reports the total current memory usage by processes in the cgroup (in bytes).
fr: rapporte la totalité de l'utilisation de mémoire actuelle par les processus dans le groupe de contrôle (en octets).

source: reports the sum of current memory usage plus swap space used by processes in the cgroup (in bytes).
fr: rapporte la somme de l'utilisation actuelle de la mémoire et de l'espace swap utilisé par les processus dans le groupe de contrôle (en octets).

source: reports the maximum memory used by processes in the cgroup (in bytes).
fr: rapporte le montant maximum de mémoire utilisée par les processus dans le groupe de contrôle (en octets).

source: reports the maximum amount of memory and swap space used by processes in the cgroup (in bytes).
fr: rapporte le montant maximum de mémoire et d'espace swap utilisé par les processus dans le groupe de contrôle (en octets).

source: sets the maximum amount of user memory (including file cache). If no units are specified, the value is interpreted as bytes. However, it is possible to use suffixes to represent larger units — <literal>k</literal> or <literal>K</literal> for kilobytes, <literal>m</literal> or <literal>M</literal> for Megabytes, and <literal>g</literal> or <literal>G</literal> for Gigabytes.
fr: définit le montant maximum de mémoire utilisateur (y compris le cache du fichier). Si aucune unité n'est saisie, la valeur sera interprétée en octets. Il est cependant possible d'utiliser des suffixes afin de représenter de plus grandes unités — <literal>k</literal> ou <literal>K</literal> pour des kilo-octets, <literal>m</literal> ou <literal>M</literal> pour des mégaoctets, et <literal>g</literal> ou <literal>G</literal> pour des gigaoctets.

source: You cannot use <systemitem>memory.limit_in_bytes</systemitem> to limit the root cgroup; you can only apply values to groups lower in the hierarchy.
fr: L'utilisation de <systemitem>memory.limit_in_bytes</systemitem> pour limiter le groupe de contrôle racine est impossible ; l'application de valeurs est uniquement possible sur des groupes se trouvant plus bas dans la hiérarchie.

source: Write <literal>-1</literal> to <systemitem>memory.limit_in_bytes</systemitem> to remove any existing limits.
fr: Écrire <literal>-1</literal> sur <systemitem>memory.limit_in_bytes</systemitem> pour supprimer toutes les limites existantes.

source: sets the maximum amount for the sum of memory and swap usage. If no units are specified, the value is interpreted as bytes. However, it is possible to use suffixes to represent larger units — <literal>k</literal> or <literal>K</literal> for kilobytes, <literal>m</literal> or <literal>M</literal> for Megabytes, and <literal>g</literal> or <literal>G</literal> for Gigabytes.
fr: définit le montant maximum de la somme de l'utilisation de la mémoire et du swap. Si aucune unité n'est saisie, la valeur sera interprétée en octets. Il est cependant possible d'utiliser des suffixes afin de représenter de plus grandes unités — <literal>k</literal> ou <literal>K</literal> pour des kilo-octets, <literal>m</literal> ou <literal>M</literal> pour des mégaoctets, et <literal>g</literal> ou <literal>G</literal> pour des gigaoctets.

source: You cannot use <systemitem>memory.memsw.limit_in_bytes</systemitem> to limit the root cgroup; you can only apply values to groups lower in the hierarchy.
fr: L'utilisation de <systemitem>memory.memsw.limit_in_bytes</systemitem> pour limiter le groupe de contrôle racine est impossible ; l'application de valeurs est uniquement possible sur des groupes se trouvant plus bas dans la hiérarchie.

source: Write <literal>-1</literal> to <systemitem>memory.memsw.limit_in_bytes</systemitem> to remove any existing limits.
fr: Écrire <literal>-1</literal> sur <systemitem>memory.memsw.limit_in_bytes</systemitem> pour supprimer toutes les limites existantes.

source: Setting the memory.memsw.limit_in_bytes and memory.limit_in_bytes parameters
fr: Réglage des paramètres memory.memsw.limit_in_bytes et memory.limit_in_bytes

source: It is important to set the <systemitem>memory.limit_in_bytes</systemitem> parameter <emphasis>before</emphasis> setting the <systemitem>memory.memsw.limit_in_bytes</systemitem> parameter; attempting to do so in the reverse order results in an error. This is because <systemitem>memory.memsw.limit_in_bytes</systemitem> becomes available only after all memory limitations (previously set in <systemitem>memory.limit_in_bytes</systemitem>) are exhausted.
fr: Il est important de définir le paramètre <systemitem>memory.limit_in_bytes</systemitem> <emphasis>avant</emphasis> le réglage du paramètre <systemitem>memory.memsw.limit_in_bytes</systemitem> ; une tentative de le faire dans l'ordre inverse provoque une erreur. Ceci s'explique par le fait que <systemitem>memory.memsw.limit_in_bytes</systemitem> ne devient disponible qu'après toutes les autres limitations sur la mémoire (précédemment indiquées dans <systemitem>memory.limit_in_bytes</systemitem>) sont épuisées.

source: Consider the following example: setting <systemitem>memory.limit_in_bytes = 2G</systemitem> and <systemitem>memory.memsw.limit_in_bytes = 4G</systemitem> for a certain cgroup will allow processes in that cgroup to allocate 2 GB of memory and, once exhausted, allocate another 2 GB of swap only; the <systemitem>memory.memsw.limit_in_bytes</systemitem> parameter represents a sum of memory and swap. Processes in a cgroup that does not have the <systemitem>memory.memsw.limit_in_bytes</systemitem> parameter set can potentially use up all the available swap (after exhausting the set memory limitation) and trigger an Out Of Memory situation caused by the lack of available swap.
fr: Prenons l'exemple suivant : les réglages <systemitem>memory.limit_in_bytes = 2G</systemitem> et <systemitem>memory.memsw.limit_in_bytes = 4G</systemitem>pour un cgroup donné permettront aux processus dans ce cgroup d'allouer 2 Gio de mémoire et, une fois cette limite épuisée, d'allouer 2 Gio de swap seulement ; le paramètre <systemitem>memory.memsw.limit_in_bytes</systemitem>représente la somme de la mémoire et du swap. Les processus dans un cgroup dont le paramètre <systemitem>memory.memsw.limit_in_bytes</systemitem> n'est pas positionné peuvent potentiellement utiliser l'intégralité du swap disponible (après avoir épuisé l'ensemblede la mémoire autorisée) et ainsi déclencher une situation d'épuisement de la mémoire causé par le manque de swap disponible.

source: The order in which the <systemitem>memory.limit_in_bytes</systemitem> and <systemitem>memory.memsw.limit_in_bytes</systemitem> parameters are set in the <filename>/etc/cgconfig.conf</filename> file is important as well. The following is a correct example of such a configuration:
fr: L'ordre dans lequel les paramètres <systemitem>memory.limit_in_bytes</systemitem> et <systemitem>memory.memsw.limit_in_bytes</systemitem> sont définis dans le fichier <filename>/etc/cgconfig.conf</filename> est tout aussi important. Ce qui suit est un exemple correct d'une telle configuration :

source: reports the number of times that the memory limit has reached the value set in <systemitem>memory.limit_in_bytes</systemitem>.
fr: rapporte le nombre de fois que la limite de mémoire a atteint la valeur définie dans <systemitem>memory.limit_in_bytes</systemitem>.

source: reports the number of times that the memory plus swap space limit has reached the value set in <systemitem>memory.memsw.limit_in_bytes</systemitem>.
fr: rapporte le nombre de fois que la limite de la somme de la mémoire et de l'espace swap a atteint la valeur définie dans <systemitem>memory.memsw.limit_in_bytes</systemitem>.

source: when set to <literal>0</literal>, empties memory of all pages used by tasks in this cgroup. This interface can only be used when the cgroup has no tasks. If memory cannot be freed, it is moved to a parent cgroup if possible. Use the <systemitem>memory.force_empty</systemitem> parameter before removing a cgroup to avoid moving out-of-use page caches to its parent cgroup.
fr: vide la mémoire de toutes les pages utilisées par des tâches dans ce groupe de contrôle lorsque défini à <literal>0</literal>. Cette interface peut uniquement être utilisée lorsque le groupe de contrôle ne possède aucune tâche. Si la mémoire ne peut pas être libérée, celle-ci sera si possible déplacée vers un groupe de contrôle parent. Utiliser <systemitem>memory.force_empty</systemitem> avant de supprimer un groupe de contrôle permet d'éviter de déplacer les caches des pages hors d'usage sur son groupe de contrôle parent.

source: sets the tendency of the kernel to swap out process memory used by tasks in this cgroup instead of reclaiming pages from the page cache. This is the same tendency, calculated the same way, as set in <filename>/proc/sys/vm/swappiness</filename> for the system as a whole. The default value is <literal>60</literal>. Values lower than <literal>60</literal> decrease the kernel's tendency to swap out process memory, values greater than <literal>60</literal> increase the kernel's tendency to swap out process memory, and values greater than <literal>100</literal> permit the kernel to swap out pages that are part of the address space of the processes in this cgroup.
fr: définit la tendance du noyau à déloger la mémoire de processus utilisée par les tâches dans ce groupe de contrôle plutôt que de réclamer des pages depuis le cache de page. Il s'agit de la même tendance et du même calcul que ce qui figure dans <filename>/proc/sys/vm/swappiness</filename> pour le système en tant que tout. La valeur par défaut est <literal>60</literal>. Des valeurs plus petites diminueront la tendance à déloger la mémoire de processus. Des valeurs plus élevées que <literal>60</literal> augmenteront la tendance du noyau à déloger la mémoire de processus, et les valeurs supérieures à <literal>100</literal> permettront au noyau de déloger des pages faisant partie de l'espace adresse pour ce groupe de contrôle.

source: Note that a value of <literal>0</literal> does not prevent process memory being swapped out; swap out might still happen when there is a shortage of system memory because the global virtual memory management logic does not read the cgroup value. To lock pages completely, use <function>mlock()</function> instead of cgroups.
fr: Remarquer que la valeur <literal>0</literal> n'empêchera pas la mémoire de processus d'être délogée ; celui-ci pourra tout de même se produire lorsqu'il y a un manque de mémoire système car la logique de gestion de la mémoire virtuelle globale ne lit pas la valeur du groupe de contrôle. Pour verrouiller complètement les pages, utiliser <function>mlock()</function> au lieu des groupes de contrôle.

source: You cannot change the swappiness of the following groups:
fr: Il n'est pas possible de modifier le "swappiness" des groupes suivants :

source: the root cgroup, which uses the swappiness set in <filename>/proc/sys/vm/swappiness</filename>.
fr: le groupe de contrôle racine, qui utilise le "swappiness" installé dans <filename>/proc/sys/vm/swappiness</filename>.

source: a cgroup that has child groups below it.
fr: un groupe de contrôle possédant des groupes enfants.

source: contains a flag (<literal>0</literal> or <literal>1</literal>) that specifies whether memory usage should be accounted for throughout a hierarchy of cgroups. If enabled (<literal>1</literal>), the memory subsystem reclaims memory from the children of and process that exceeds its memory limit. By default (<literal>0</literal>), the subsystem does not reclaim memory from a task's children.
fr: contient un indicateur (<literal>0</literal> ou <literal>1</literal>) spécifiant si la mémoire utilisée devrait être prise en compte sur une hiérarchie de groupes de contrôle. Si activé (<literal>1</literal>), le sous-système de la mémoire récupèrera la mémoire de tous les processus enfants excédant la limite de mémoire. Par défaut (<literal>0</literal>), le sous-système ne récupère pas la mémoire d'une tâche enfant.

source: The <systemitem>net_cls</systemitem> subsystem tags network packets with a class identifier (classid) that allows the Linux traffic controller (<application>tc</application>) to identify packets originating from a particular cgroup. The traffic controller can be configured to assign different priorities to packets from different cgroups.
fr: Le sous-système <systemitem>net_cls</systemitem> repère les paquets réseau avec un identifiant de classe (classid) qui permet au contrôleur de trafic Linux (<application>tc</application>) d'identifier les paquets provenant d'un groupe de contrôle particulier. Le contrôleur de trafic peut être configuré de manière à assigner différentes priorités à des paquets provenant de différents groupes de contrôle.

source: <filename>net_cls.classid</filename> contains a single value that indicates a traffic control <firstterm>handle</firstterm>. The value of <parameter>classid</parameter> read from the <filename>net_cls.classid</filename> file is presented in the decimal format while the value to be written to the file is expected in the hexadecimal format. For example, <literal>0x100001</literal> represents the handle conventionally written as <literal>10:1</literal> in the format used by <package>iproute2</package>. In the <filename>net_cls.classid</filename> file, it would be represented by the number <literal>1048577</literal>.
fr: Le fichier <filename>net_cls.classid</filename> contient une valeur unique qui indiqueun <firstterm>descripteur</firstterm> de contrôle du trafic. La valeur de <parameter>classid</parameter> lue à partir du fichier <filename>net_cls.classid</filename> est présenté dans le format décimal tandis que la valeur à écrire dans le fichier est attendue dans le format hexadécimal. Ainsi, <literal>0x100001</literal> représente le descripteur écrit habituellement comme <literal>10:1</literal> dans le format utilisé par <package>iproute2</package>. Dans le fichier <filename>net_cls.classid</filename>, il serait représenté par le nombre <literal>1048577</literal>.

source: The format for these handles is: <literal>0x<replaceable>AAAA</replaceable><replaceable>BBBB</replaceable></literal>, where <replaceable>AAAA</replaceable> is the major number in hexadecimal and <replaceable>BBBB</replaceable> is the minor number in hexadecimal. You can omit any leading zeroes; <literal>0x10001</literal> is the same as <literal>0x00010001</literal>, and represents <literal>1:1</literal>. The following is an example of setting a <literal>10:1</literal> handle in the <filename>net_cls.classid</filename> file:
fr: Le format de ces descripteurs (handles) est comme suit : <literal>0x<replaceable>AAAA</replaceable><replaceable>BBBB</replaceable></literal>, où <replaceable>AAAA</replaceable> est le numéro majeur en hexadécimal et où <replaceable>BBBB</replaceable> est le numéro mineur en hexadécimal. Les zéros initiaux peuvent être omis : <literal>0x10001</literal> est la même chose que <literal>0x00010001</literal>, et représente <literal>1:1</literal>. Ce qui suit est un example positionnant le descripteur <literal>10:1</literal> dans le fichier <filename>net_cls.classid</filename> :

source: Refer to the man page for <application>tc</application> to learn how to configure the traffic controller to use the handles that the <systemitem>net_cls</systemitem> adds to network packets.
fr: Se reporter à la page de manuel de <application>tc</application> afin d'apprendre comment configurer le contrôleur de trafic pour qu'il utilise les handles que <systemitem>net_cls</systemitem> ajoute aux paquets réseau.
