Repository: jfenal-zz/fedora-trans-fr
Catalog: for_translation_resource-management-guide_Subsystems_and_Tunable_Parameters_*.po
Languages: fr

source: applicable to realtime scheduling tasks only, this parameter specifies a period of time in microseconds (µs, represented here as "<parameter>us</parameter>") for how regularly a cgroup's access to CPU resource should be reallocated. If the tasks in a cgroup should be able to access CPU resources for 4 seconds out of every 5 seconds, set <filename>cpu.rt_runtime_us</filename> to <literal>4000000</literal> and <filename>cpu.rt_period_us</filename> to <literal>5000000</literal>.
fr: applicables aux seules tâches gérées par l'ordonnanceur temps-réel, ce paramètre spécifie une période de temps en microsecondes (µs, représenté ici sous la forme "us") pour définir à quelle fréquence réallouer l'accès d'un groupe de contrôle aux ressources du CPU. Si les tâches d'un groupe de contrôle doivent pouvoir accéder aux ressources du CPU pendant 4 secondes sur chaque période de 5 secondes, ajuster <filename>cpu.rt_runtime_us</filename> sur <literal>4000000</literal> et <filename>cpu.rt_period_us</filename> sur <literal>5000000</literal>.

source: The CPU Accounting (<systemitem>cpuacct</systemitem>) subsystem generates automatic reports on CPU resources used by the tasks in a cgroup, including tasks in child groups. Three reports are available:
fr: Le sous-système <systemitem>cpuacct</systemitem> génère des rapports automatiques sur les ressources CPU utilisées par les tâches dans un groupe de contrôle, y compris les tâches dans les groupes enfants. Trois rapports sont disponibles :

source: reports the total CPU time (in nanoseconds) consumed by all tasks in this cgroup (including tasks lower in the hierarchy).
fr: rapporte le temps de CPU total (en nanosecondes) pris par toutes les tâches dans ce groupe de contrôle (y compris les tâches situées plus bas dans la hiérarchie).

source: Resetting cpuacct.usage
fr: Remise à zéro de cpuacct.usage

source: To reset the value in <systemitem>cpuacct.usage</systemitem>, execute the following command:
fr: Pour réinitialiser la valeur de <systemitem>cpuacct.usage</systemitem>, exécuter la commande suivante :

source: The above command also resets values in <systemitem>cpuacct.usage_percpu</systemitem>.
fr: La commande ci-dessus réinitialise aussi les valeurs de <systemitem>cpuacct.usage_percpu</systemitem>.

source: reports the user and system CPU time consumed by all tasks in this cgroup (including tasks lower in the hierarchy) in the following way:
fr: rapporte comme suit le temps de CPU total (en nanosecondes) pris par toutes les tâches dans ce groupe de contrôle (y compris les tâches situées plus bas dans la hiérarchie) :

source: <systemitem>user</systemitem> &mdash; CPU time consumed by tasks in user mode.
fr: <systemitem>user</systemitem> &mdash; temps CPU consommé par les tâches en mode utilisateur.

source: <systemitem>system</systemitem> &mdash; CPU time consumed by tasks in system (kernel) mode.
fr: <systemitem>system</systemitem> &mdash; temps CPU consommé par les tâches en mode système (noyau).

source: CPU time is reported in the units defined by the <systemitem>USER_HZ</systemitem> variable.
fr: Le temps CPU time est rapporté dans les unités définies par la variable <systemitem>USER_HZ</systemitem>.

source: reports the CPU time (in nanoseconds) consumed on each CPU by all tasks in this cgroup (including tasks lower in the hierarchy).
fr: rapporte le temps de CPU (en nanosecondes) pris sur chaque CPU par toutes les tâches présentes dans ce groupe de contrôle (y compris les tâches situées plus bas dans la hiérarchie).

source: The <systemitem>cpuset</systemitem> subsystem assigns individual CPUs and memory nodes to cgroups. Each cpuset can be specified according to the following parameters, each one in a separate <firstterm>pseudofile</firstterm> within the cgroup virtual file system:
fr: Le sous-système <systemitem>cpuset</systemitem> assigne les CPU individuels et les noeuds de mémoire à des groupes de contrôle. Chaque cpuset peut être spécifié en fonction des paramètres suivants, chacun dans un <firstterm>pseudo-fichier</firstterm> différent du système de fichiers virtuel du groupe de contrôle :

source: Mandatory parameters
fr: Paramètres obligatoires

source: Some subsystems have mandatory parameters that must be set before you can move a task into a cgroup which uses any of those subsystems. For example, before you move a task into a cgroup which uses the <systemitem class="resource">cpuset</systemitem> subsystem, the <filename>cpuset.cpus</filename> and <filename>cpuset.mems</filename> parameters must be defined for that cgroup.
fr: Certains sous-systèmes ont des paramètres obligatoires à définir avant de pouvoir déplacer une tâche dans un groupe de contrôle qui utilise l'un de ces sous-systèmes. Par exemple, avant de déplacer une tâche dans un cgroup qui utilise le sous-système <systemitem class="resource">cpuset</systemitem>. les paramètres <filename>cpuset.cpus</filename> et <filename>cpuset.mems</filename> doivent être définis pour ce cgroup.

source: cpuset.cpus (mandatory)
fr: cpuset.cpus (obligatoire)

source: specifies the CPUs that tasks in this cgroup are permitted to access. This is a comma-separated list in ASCII format, with dashes ("<literal>-</literal>") to represent ranges. For example,
fr: spécifie à quels CPU les tâches dans ce groupe de contrôle ont la permission d'accéder. Ceci est une liste séparée par des virgules sous le format ASCII, avec des tirets ("<literal>-</literal>") pour représenter l'étendue. Par exemple :

source: represents CPUs 0, 1, 2, and 16.
fr: représente les CPUs 0, 1, 2, et 16.

source: cpuset.mems (mandatory)
fr: cpuset.mems (obligatoire)

source: specifies the memory nodes that tasks in this cgroup are permitted to access. This is a comma-separated list in ASCII format, with dashes ("<literal>-</literal>") to represent ranges. For example,
fr: spécifie les noeuds de mémoire auxquels les tâches de ce groupe de contrôle auront la permission d'accéder. Ceci est une liste séparée par des virgules sous le format ASCII, avec des tirets ("<literal>-</literal>") pour repésenter l'étendue. Par exemple,

source: represents memory nodes 0, 1, 2, and 16.
fr: représente les noeuds de mémoire 0, 1, 2, et 16.

source: contains a flag (<literal>0</literal> or <literal>1</literal>) that specifies whether a page in memory should migrate to a new node if the values in <filename>cpuset.mems</filename> change. By default, memory migration is disabled (<literal>0</literal>) and pages stay on the node to which they were originally allocated, even if this node is no longer one of the nodes now specified in <filename>cpuset.mems</filename>. If enabled (<literal>1</literal>), the system will migrate pages to memory nodes within the new parameters specified by <filename>cpuset.mems</filename>, maintaining their relative placement if possible — for example, pages on the second node on the list originally specified by <filename>cpuset.mems</filename> will be allocated to the second node on the list now specified by <filename>cpuset.mems</filename>, if this place is available.
fr: contient un indicateur (<literal>0</literal> ou <literal>1</literal>) spécifiant si une page en mémoire devrait migrer vers un nouveau noeud si les valeurs dans <filename>cpuset.mems</filename> changent. Par défaut, la migration de mémoire est désactivée (<literal>0</literal>) et les pages restent sur le noeud auquel elles ont été assignées à l'origine, même si celui-ci ne fait maintenant plus partie des noeuds spécifiés dans <filename>cpuset.mems</filename>. Si la migration est activée (<literal>1</literal>), le système migrera les pages vers les noeuds de mémoire faisant partie des nouveaux paramètres spécifiés par <filename>cpuset.mems</filename>, tout en maintenant leur position respective dans la mesure du possible — par exemple, les pages sur le second noeud sur la liste spécifiée à l'origine par <filename>cpuset.mems</filename> seront allouées au second noeud sur la liste maintenant spécifiée par <filename>cpuset.mems</filename>, si cette position est disponible.

source: contains a flag (<literal>0</literal> or <literal>1</literal>) that specifies whether cpusets other than this one and its parents and children can share the CPUs specified for this cpuset. By default (<literal>0</literal>), CPUs are not allocated exclusively to one cpuset.
fr: contient un indicateur (<literal>0</literal> ou <literal>1</literal>) spécifiant si des cpusets autres que celui-ci, que ses parents ou que ses enfants peuvent partager les CPUs spécifiés pour ce cpuset. Par défaut (<literal>0</literal>), les CPUs ne sont pas exclusivement alloués à un seul cpuset.

source: contains a flag (<literal>0</literal> or <literal>1</literal>) that specifies whether other cpusets can share the memory nodes specified for this cpuset. By default (<literal>0</literal>), memory nodes are not allocated exclusively to one cpuset. Reserving memory nodes for the exclusive use of a cpuset (<literal>1</literal>) is functionally the same as enabling a memory hardwall with the <filename>cpuset.mem_hardwall</filename> parameter.
fr: contient un indicateur (<literal>0</literal> ou <literal>1</literal>) spécifiant si d'autres cpusets peuvent partager les noeuds de mémoire spécifiés pour ce cpuset. Par défaut (<literal>0</literal>), les noeuds de mémoire ne sont pas exclusivement alloués à un seul cpuset. Réserver des noeuds de mémoire pour une utilisation exclusive d'un seul cpuset ((<literal>1</literal>) est fonctionnellement identique à l'activation d'un hardwall mémoire avec <filename>cpuset.mem_hardwall</filename>.

source: contains a flag (<literal>0</literal> or <literal>1</literal>) that specifies whether kernel allocations of memory page and buffer data should be restricted to the memory nodes specified for this cpuset. By default (<literal>0</literal>), page and buffer data is shared across processes belonging to multiple users. With a hardwall enabled (<literal>1</literal>), each tasks' user allocation can be kept separate.
fr: contient un indicateur (<literal>0</literal> ou <literal>1</literal>) spécifiant si les allocations au noyau de pages mémoire et de données de tampon devraient être restreintes aux noeuds de mémoire spécifiés pour ce cpuset. Par défaut (<literal>0</literal>), les pages et les données de tampon sont partagées par les processus appartenant à de multiples utilisateurs. Avec un hardwall activé (<literal>1</literal>), la mémoire allouée aux tâches de chaque utilisateur peut être séparée de la mémoire allouée aux tâches de tous les autres utilisateurs.

source: a read-only file that contains a running average of the <firstterm>memory pressure</firstterm> created by the processes in this cpuset. The value in this pseudofile is automatically updated when <filename>cpuset.memory_pressure_enabled</filename> is enabled, otherwise, the pseudofile contains the value <literal>0</literal>.
fr: un fichier en lecture seule qui contient une moyenne en cours d'exécution de la solicitation de mémoire (<firstterm>memory pressure</firstterm>), créée par les processus dans ce cpuset. La valeur dans ce pseudofichier est automatiquement mise à jour lorsque <filename>cpuset.memory_pressure_enabled</filename> est activé, sinon le pseudofichier contient la valeur <literal>0</literal>.

source: contains a flag (<literal>0</literal> or <literal>1</literal>) that specifies whether the system should compute the <firstterm>memory pressure</firstterm> created by the processes in this cgroup. Computed values are output to <filename>cpuset.memory_pressure</filename> and represent the rate at which processes attempt to free in-use memory, reported as an integer value of attempts to reclaim memory per second, multiplied by 1000.
fr: contient un indicateur (<literal>0</literal> ou <literal>1</literal>) spécifiant si le système doit calculer la solicitation de mémoire (<firstterm>memory pressure</firstterm>) créée par les processus dans ce groupe de contrôle. Les valeurs calculées sortent dans <filename>cpuset.memory_pressure</filename> et représentent le taux auquel les processus tentent de libérer la mémoire utilisée, ces valeurs sont rapportées en chiffres entiers et s'expliquent par le nombre de tentatives de récupération de mémoire par seconde, multiplié par 1000.

source: contains a flag (<literal>0</literal> or <literal>1</literal>) that specifies whether file system buffers should be spread evenly across the memory nodes allocated to this cpuset. By default (<literal>0</literal>), no attempt is made to spread memory pages for these buffers evenly, and buffers are placed on the same node on which the process that created them is running.
fr: contient un indicateur (<literal>0</literal> ou <literal>1</literal>) spécifiant si les tampons de systèmes de fichiers doivent être placés de manière régulièresur les noeuds de mémoire alloués à ce cpuset. Par défaut (<literal>0</literal>), aucune tentative de placer les pages de mémoire sur ces tampons de manière régulière n'est faite, et ceux-ci sont placés sur le noeud où le processus qui les a créés est en cours d'exécution.

source: contains a flag (<literal>0</literal> or <literal>1</literal>) that specifies whether kernel slab caches for file input/output operations should be spread evenly across the cpuset. By default (<literal>0</literal>), no attempt is made to spread kernel slab caches evenly, and slab caches are placed on the same node on which the process that created them is running.
fr: contient un indicateur (<literal>0</literal> ou <literal>1</literal>) spécifiant si les caches slab du noyau pour opérations d'entrée/sortie doivet être placés de manière régulière sur le cpuset. Par défaut (<literal>0</literal>), aucune tentative de placer les caches slab du noyau de manière régulière n'est faite, et ceux-ci sont placés sur le noeud où le processus qui les a créés est en cours d'exécution.

source: contains a flag (<literal>0</literal> or <literal>1</literal>) that specifies whether the kernel will balance loads across the CPUs in this cpuset. By default (<literal>1</literal>), the kernel balances loads by moving processes from overloaded CPUs to less heavily used CPUs.
fr: contient un indicateur (<literal>0</literal> ou <literal>1</literal>) spécifiant si le noyau va équilibrer les charges sur les CPU dans ce cpuset. Par défaut (<literal>1</literal>), le noyau équilibre les charges en déplaçant les processus des CPUs surchargés sur des CPUs moins solicités.

source: Note, however, that setting this flag in a cgroup has no effect if load balancing is enabled in any parent cgroup, as load balancing is already being carried out at a higher level. Therefore, to disable load balancing in a cgroup, disable load balancing also in each of its parents in the hierarchy. In this case, you should also consider whether load balancing should be enabled for any siblings of the cgroup in question.
fr: Remarquer cependant que définir cet indicateur dans un cgroup n'a aucun effet si l'équilibrage des charges est activé dans tout cgroup parent, car l'équilibrage des charges est déjà en cours à un niveau plus élevé. Ainsi, pour désactiver l'équilibrage des charges dans un cgroup, désactiver aussi l'équilibrage des charges dans chacun de ses parents dans la hiérarchie. Dans ce cas, il est nécessaire de se demander si l'équilibrage des charges doit être activé sur les autres relations de même parenté du groupe de contrôle en question.

source: contains an integer between <literal>-1</literal> and a small positive value, which represents the width of the range of CPUs across which the kernel should attempt to balance loads. This value is meaningless if <filename>cpuset.sched_load_balance</filename> is disabled.
fr: contient un entier entre <literal>-1</literal> et une petite valeur positive, qui représente la largeur de l'étendue des CPUs sur laquelle le noyau va essayer d'équilibrer les charges. Cette valeur n'a aucun sens si <filename>cpuset.sched_load_balance</filename> est désactivé.

source: The precise effect of this value varies according to system architecture, but the following values are typical:
fr: L'effet précis de cette valeur varie en fonction de l'architecture du système, mais les valeurs suivantes sont typiques :

source: Values of cpuset.sched_relax_domain_level
fr: Valeurs de cpuset.sched_relax_domain_level

source: Value
fr: Valeur

source: Effect
fr: Effet

source: Use the system default value for load balancing
fr: Utilise la valeur par défaut du système pour l'équilibrage des charges

source: Do not perform immediate load balancing; balance loads only periodically
fr: N'effectue pas d'équilibrage des charges immédiat ; équilibre les charges de manière périodique uniquement

source: Immediately balance loads across threads on the same core
fr: Équilibre immédiatement les charges sur les threads du même coeur

source: Immediately balance loads across cores in the same package
fr: Équilibre immédiatement les charges sur les coeurs dans le même paquetage

source: Immediately balance loads across CPUs on the same node or blade
fr: Équilibre immédiatement les charges sur les CPUs du même noeud ou de la même lame

source: Immediately balance loads across several CPUs on architectures with non-uniform memory access (NUMA)
fr: Équilibre immédiatement les charges sur plusieurs CPUs sur des architectures à accès non uniforme à la mémoire (NUMA)

source: Immediately balance loads across all CPUs on architectures with NUMA
fr: Équilibre immédiatement les charges sur tous les CPUs sur architectures avec NUMA

source: devices
fr: Périphériques

source: The <systemitem>devices</systemitem> subsystem allows or denies access to devices by tasks in a cgroup.
fr: Le sous-système <systemitem>devices</systemitem> autorise ou refuse l'accès des tâches aux périphériques dans un groupe de contrôle.

source: specifies devices to which tasks in a cgroup have access. Each entry has four fields: <replaceable>type</replaceable>, <replaceable>major</replaceable>, <replaceable>minor</replaceable>, and <replaceable>access</replaceable>. The values used in the <replaceable>type</replaceable>, <replaceable>major</replaceable>, and <replaceable>minor</replaceable> fields correspond to device types and node numbers specified in <citetitle>Linux Allocated Devices</citetitle>, otherwise known as the <citetitle>Linux Devices List</citetitle> and available from <ulink url="http://www.kernel.org/doc/Documentation/devices.txt" />.
fr: spécifie à quels périphériques les tâches d'un groupe de contrôle peuvent avoir accès. Chaque entrée possède quatre champs : <replaceable>type</replaceable>, <replaceable>majeur</replaceable>, <replaceable>mineur</replaceable> et <replaceable>accès</replaceable>. Les valeurs utilisées dans les champs <replaceable>type</replaceable>, <replaceable>majeur</replaceable> et <replaceable>mineur</replaceable> correspondent au type de périphérique et aux numéros de noeuds spécifiés dans <citetitle>périphériques alloués de Linux</citetitle>, aussi connu sous le nom de <citetitle>Liste des périphériques Linux</citetitle> et disponible depuis <ulink url="http://www.kernel.org/doc/Documentation/devices.txt" />.

source: <replaceable>type</replaceable> can have one of the following three values:
fr: <replaceable>type</replaceable> peut avoir l'une des trois valeurs suivantes :

source: <literal>a</literal> — applies to all devices, both <firstterm>character devices</firstterm> and <firstterm>block devices</firstterm>
fr: <literal>a</literal> — s'applique à tous les périphériques, <firstterm>périphérique de type caractère</firstterm> et <firstterm>périphériques blocs</firstterm>

source: <literal>b</literal> — specifies a block device
fr: <literal>b</literal> — spécifie un périphérique bloc

source: <literal>c</literal> — specifies a character device
fr: <literal>c</literal> — spécifie un périphérique de type caractère

source: major
fr: majeur

source: minor
fr: mineur

source: <replaceable>major</replaceable> and <replaceable>minor</replaceable> are device node numbers specified by <citetitle>Linux Allocated Devices</citetitle>. The major and minor numbers are separated by a colon. For example, <literal>8</literal> is the major number that specifies SCSI disk drives, and the minor number <literal>1</literal> specifies the first partition on the first SCSI disk drive; therefore <literal>8:1</literal> fully specifies this partition, corresponding to a file system location of <filename>/dev/sda1</filename>.
fr: <replaceable>majeur</replaceable> et <replaceable>mineur</replaceable> sont des numéros de noeuds de périphériques spécifiés par <citetitle>périphériques alloués de Linux</citetitle>. Les numéros majeurs et mineurs sont séparés par deux points. Par exemple, <literal>8</literal> est le numéro majeur spécifiant les lecteurs de disques SCSI, et le numéro mineur <literal>1</literal> spécifie la première partition du premier lecteur de disque SCSI ; ainsi, <literal>8:1</literal> spécifie cette partition en détails, correspondant à l'emplacement sur le système de fichiers de <filename>/dev/sda1</filename>.

source: <literal>*</literal> can stand for all major or all minor device nodes, for example <literal>9:*</literal> (all RAID devices) or <literal>*:*</literal> (all devices).
fr: <literal>*</literal> peut remplacer tous les noeuds de périphériques majeurs ou mineurs. Par exemple, <literal>9:*</literal> (tous les périphériques RAID), ou même <literal>*:*</literal> (tous les périphériques).

source: access
fr: accès

source: <replaceable>access</replaceable> is a sequence of one or more of the following letters:
fr: <replaceable>accès</replaceable> est une séquence d'une ou plusieurs des lettres suivantes :

source: <literal>r</literal> — allows tasks to read from the specified device
fr: <literal>r</literal> — autorise les tâches à lire le périphérique spécifié

source: <literal>w</literal> — allows tasks to write to the specified device
fr: <literal>w</literal> — autorise les tâches à écrire sur le périphérique spécifié

source: <literal>m</literal> — allows tasks to create device files that do not yet exist
fr: <literal>m</literal> — autorise les tâches à créer des fichiers de périphériques qui n'existent pas encore

source: For example, when <replaceable>access</replaceable> is specified as <literal>r</literal>, tasks can only read from the specified device, but when <replaceable>access</replaceable> is specified as <literal>rw</literal>, tasks can read from and write to the device.
fr: Par exemple, lorsque l'<replaceable>accès</replaceable> est spécifié en tant que <literal>r</literal>, les tâches peuvent uniquement lire le périphérique spécifié, mais lorsque l'<replaceable>accès</replaceable> est spécifié en tant que <literal>rw</literal>, les tâches peuvent lire et écrire sur le périphérique.

source: specifies devices that tasks in a cgroup cannot access. The syntax of entries is identical with <filename>devices.allow</filename>.
fr: spécifie à quels périphériques les tâches dans un groupe de contrôle ne peuvent pas avoir accès. La syntaxe des entrées est identique à celle de <filename>devices.allow</filename>.

source: reports the devices for which access controls have been set for tasks in this cgroup.
fr: rapporte les périphériques pour lesquels les contrôles d'accès ont été définis pour des tâches dans ce groupe de contrôle.

source: The <systemitem>freezer</systemitem> subsystem suspends or resumes tasks in a cgroup.
fr: Le sous-système <systemitem>freezer</systemitem> suspend ou réactive les tâches dans un groupe de contrôle.

source: <systemitem>freezer.state</systemitem> has three possible values:
fr: <systemitem>freezer.state</systemitem> possède trois valeurs possibles :
