Repository: jfenal-zz/fedora-trans-fr
Catalog: for_translation_resource-management-guide_Using_Control_Groups_*.po
Languages: fr

source: <option>-t</option> (optional) — specifies a user (by user ID, uid) and a group (by group ID, gid) to own the <filename>tasks</filename> pseudo-file for this cgroup. This user can add tasks to the cgroup.
fr: <option>-t</option> (optionnelle) — définit un utilisateur (par son ID utilisateur, ou uid) et un groupe (par son ID de groupe, ou GID) qui sera le propriétaire du pseudo-fichier <filename>tasks</filename> pour ce groupe de contrôle. Cet utilisateur peut ajouter des tâches à ce groupe de contrôle.

source: Removing tasks
fr: Supprimer des tâches

source: Note that the only way to remove a task from a cgroup is to move it to a different cgroup. To move a task, the user must have write access to the <emphasis>destination</emphasis> cgroup; write access to the source cgroup is unimportant.
fr: Remarquer que l'unique manière de supprimer une tâche d'un groupe de contrôle est de la déplacer vers un autre groupe de contrôle. Pour déplacer une tâche, l'utilisateur doit posséder la permission d'écriture sur le groupe de contrôle <emphasis>destinataire</emphasis> ; la permission d'écriture sur le groupe de contrôle source n'a pas d'importance

source: <option>-a</option> (optional) — specifies a user (by user ID, uid) and a group (by group ID, gid) to own all pseudo-files other than <filename>tasks</filename> for this cgroup. This user can modify the access that the tasks in this cgroup have to system resources.
fr: <option>-a</option> (optionnelle) — définit un utilisateur (par son ID utilisateur, ou uid) et un groupe (par son ID de groupe, ou GID) qui sera le propriétaire du pseudo-fichier <filename>tasks</filename> pour ce groupe de contrôle. Cet utilisateur peut modifier les accès des tâches de ce groupe de contrôle aux ressources système.

source: <option>-g</option> — specifies the hierarchy in which the cgroup should be created, as a comma-separated list of the <replaceable>subsystems</replaceable> associated with those hierarchies. If the subsystems in this list are in different hierarchies, the group is created in each of these hierarchies. The list of hierarchies is followed by a colon and the <replaceable>path</replaceable> to the child group relative to the hierarchy. Do not include the hierarchy mount point in the path.
fr: <option>-g</option> — définit la hiérarchie dans laquelle le groupe de contrôle doit être créé, sous forme de liste des <replaceable>sous-systèmes</replaceable> associés à ces hiérarchies séparés par des virgules. Si les sous-systèmes de cette liste se trouvent dans des hiérarchies différentes, le groupe est créé dans chacune d'entre elles. La liste des hiérarchies est suivie par deux-points puis par le <replaceable>chemin d'accès</replaceable> vers le groupe enfant relatif à la hiérarchie. Ne pas inclure le point de montage de la hiérarchie dans le chemin d'accès.

source: For example, the cgroup located in the directory <filename>/cgroup/cpu_and_mem/lab1/</filename> is called just <filename>lab1</filename> — its path is already uniquely determined because there is at most one hierarchy for a given subsystem. Note also that the group is controlled by all the subsystems that exist in the hierarchies in which the cgroup is created, even though these subsystems have not been specified in the <command>cgcreate</command> command — refer to <xref linkend="cgcreate_usage" />.
fr: Par exemple, le groupe de contrôle se trouvant dans le répertoire <filename>/cgroup/cpu_and_mem/lab1/</filename> est simplement appelé <filename>lab1</filename> — son chemin d'accès est déjà déterminé de manière unique car il y a, au plus, une seule hiérarchie pour un sous-système donné. Remarquer aussi que le groupe est contrôlé par tous les sous-systèmes qui existent dans les hiérarchies dans lesquelles le groupe de contrôle a été créé, même si ces sous-systèmes n'ont pas été spécifiés dans la commande <command>cgcreate</command> — se reporter à la <xref linkend="cgcreate_usage" />.

source: Because all cgroups in the same hierarchy have the same controllers, the child group has the same controllers as its parent.
fr: Comme tous les groupes de contrôle dans la même hiérarchie possèdent les mêmes contrôleurs, le groupe enfant possède les mêmes contrôleurs que son parent.

source: cgcreate usage
fr: Utilisation de cgcreate

source: Consider a system where the <systemitem>cpu</systemitem> and <systemitem>memory</systemitem> subsystems are mounted together in the <systemitem>cpu_and_mem</systemitem> hierarchy, and the <systemitem>net_cls</systemitem> controller is mounted in a separate hierarchy called <systemitem>net</systemitem>. We now run:
fr: Si l'on considère un système où les sous-systèmes <systemitem>cpu</systemitem> et <systemitem>memory</systemitem> sont montés ensemble dans la hiérarchie <systemitem>cpu_and_mem</systemitem> et où le contrôleur <systemitem>net_cls</systemitem> est monté dans une hiérarchie séparée nommée <systemitem>net</systemitem>. Exécuter ensuite :

source: The <command>cgcreate</command> command creates two groups named <systemitem>test-subgroup</systemitem>, one in the <systemitem>cpu_and_mem</systemitem> hierarchy and one in the <systemitem>net</systemitem> hierarchy. The <systemitem>test-subgroup</systemitem> group in the <systemitem>cpu_and_mem</systemitem> hierarchy is controlled by the <systemitem>memory</systemitem> subsystem, even though we did not specify it in the <command>cgcreate</command> command.
fr: La commande <command>cgcreate</command> crée deux groupes nommés <systemitem>test-subgroup</systemitem>, un dans la hiérarchie <systemitem>cpu_and_mem</systemitem> et un dans la hiérarchie <systemitem>net</systemitem>. Le groupe <systemitem>test-subgroup</systemitem> dans la hiérarchie <systemitem>cpu_and_mem</systemitem> est contrôlé par le sous-système <systemitem>memory</systemitem>, même si nous ne l'avons pas spécifié dans la commande <command>cgcreate</command>.

source: To create a child of the cgroup directly, use the <command>mkdir</command> command:
fr: Pour créer un enfant du groupe de contrôle, utiliser la commande <command>mkdir</command> :

source: Removing Control Groups
fr: Supprimer des groupes de contrôle

source: Remove cgroups with the <command>cgdelete</command>, which has a syntax similar to that of <command>cgcreate</command>. Run the following command:
fr: La suppression de cgroups se fait à l'aide de la commande <command>cgdelete</command>, dont la syntaxe est similaire à celle de la commande <command>cgcreate</command>, comme suit :

source: <replaceable>subsystems</replaceable> is a comma-separated list of subsystems.
fr: <replaceable>subsystems</replaceable> est une liste des sous-systèmes séparés par des virgules.

source: <replaceable>path</replaceable> is the path to the cgroup relative to the root of the hierarchy.
fr: <replaceable>path</replaceable> est le chemin d'accès vers le groupe de contrôle relatif à la racine (root) de la hiérarchie.

source: <command>cgdelete</command> can also recursively remove all subgroups with the option <option>-r</option>.
fr: <command>cgdelete</command> peut aussi supprimer récursivement tous les sous-groupes avec l'option <option>-r</option>.

source: When you delete a cgroup, all its tasks move to its parent group.
fr: Lorsque l'on supprime un groupe de contrôle, toutes ses tâches se déplacent vers son groupe parent.

source: Setting Parameters
fr: Définir les paramètres

source: Set subsystem parameters by running the <command>cgset</command> command from a user account with permission to modify the relevant cgroup. For example, if <filename>/cgroup/cpuset/group1</filename> exists, specify the CPUs to which this group has access with the following command:
fr: Il est possible de définir les paramètres des sous-systèmes en exécutant la commande <command>cgset</command> depuis un compte utilisateur avec la permission de modifier le groupe de contrôle approprié. Par exemple, si <filename>/cgroup/cpuset/group1</filename> existe, spécifier les CPUs auxquelles ce groupe aura accès avec la commande suivante :

source: The syntax for <command>cgset</command> is:
fr: la syntaxe de <command>cgset</command> est :

source: <replaceable>parameter</replaceable> is the parameter to be set, which corresponds to the file in the directory of the given cgroup
fr: <replaceable>parameter</replaceable> est le paramètre à définir, celui du fichier dans le répertoire du groupe de contrôle donné

source: <replaceable>value</replaceable> is the value for the parameter
fr: <replaceable>value</replaceable> est la valeur du paramètre

source: <replaceable>path_to_cgroup</replaceable> is the path to the cgroup <emphasis>relative to the root of the hierarchy</emphasis>. For example, to set the parameter of the root group (if <filename>/cgroup/cpuacct/</filename> exists), run:
fr: <replaceable>path_to_cgroup</replaceable> est le chemin d'accès au groupe de contrôle <emphasis>relatif à la racine de la hiérarchie</emphasis>. Par exemple, pour définir le paramètre du groupe racine (si <filename>/cgroup/cpuacct/</filename> existe), exécuter :

source: Alternatively, because <literal>.</literal> is relative to the root group (that is, the root group itself) you could also run:
fr: En variante, comme <literal>.</literal> désigne le groupe racine (le groupe racine lui-même), on peut aussi exécuter :

source: Note, however, that <literal>/</literal> is the preferred syntax.
fr: Remarquer cependant que <literal>/</literal> est la syntaxe préférée.

source: Setting parameters for the root group
fr: Définir les paramètres du groupe racine

source: Only a small number of parameters can be set for the root group (such as the <filename>cpuacct.usage</filename> parameter shown in the examples above). This is because a root group owns all of the existing resources, therefore, it would make no sense to limit all existing processes by defining certain parameters, for example the <filename>cpuset.cpu</filename> parameter.
fr: Seul un petit nombre de paramètres peuvent être définis pour le groupe racine (comme le paramètre <filename>cpuacct.usage</filename> montré dans les exemples ci-dessus). Ceci est dû au fait qu'un groupe racine est propriétaire de toutes les ressources existantes. Ainsi, il ne servirait à rien de limiter tous les processus existants en définissant certains paramètres, le paramètre <filename>cpuset.cpu</filename> par exemple.

source: To set the parameter of <systemitem>group1</systemitem>, which is a subgroup of the root group, run:
fr: Pour définir le paramètre de <systemitem>group1</systemitem>, qui est un sous-groupe du groupe racine, exécuter :

source: A trailing slash on the name of the group (for example, <command>cpuacct.usage=0 group1/</command>) is optional.
fr: Une barre oblique finale après le nom du groupe est optionnelle (par exemple, <command>cpuacct.usage=0 group1/</command>).

source: The values that you can set with <command>cgset</command> might depend on values set higher in a particular hierarchy. For example, if <filename>group1</filename> is limited to use only CPU&nbsp;0 on a system, you cannot set <filename>group1/subgroup1</filename> to use CPUs&nbsp;0 and 1, or to use only CPU&nbsp;1.
fr: Les valeurs que l'on peut définir avec <command>cgset</command> peuvent dépendre des valeurs définies plus haut dans la hiérarchie. Par exemple, si <filename>group1</filename> est limité à l'unique utilisation de CPU&nbsp;0 sur un système, on ne peut pas définir <filename>group1/subgroup1</filename> pour qu'il utilise CPUs&nbsp;0 et 1, ou pour qu'il utilise uniquement CPU&nbsp;1.

source: You can also use <command>cgset</command> to copy the parameters of one cgroup into another, existing cgroup. For example:
fr: On peut aussi utiliser <command>cgset</command> pour copier les paramètres d'un groupe de contrôle dans un autre groupe de contrôle existant. Par exemple :

source: The syntax to copy parameters with <command>cgset</command> is:
fr: La syntaxe permettant la copie de paramètres avec la commande <command>cgset</command> est la suivante :

source: <replaceable>path_to_source_cgroup</replaceable> is the path to the cgroup whose parameters are to be copied, relative to the root group of the hierarchy
fr: <replaceable>path_to_source_cgroup</replaceable> est le chemin d'accès au groupe de contrôle dont les paramètres sont à copier, chemin se rapportant au groupe racine de la hiérarchie

source: <replaceable>path_to_target_cgroup</replaceable> is the path to the destination cgroup, relative to the root group of the hierarchy
fr: <replaceable>path_to_target_cgroup</replaceable> est le chemin d'accès au groupe de contrôle destinataire, chemin relatif au groupe racine de la hiérarchie

source: Ensure that any mandatory parameters for the various subsystems are set before you copy parameters from one group to another, or the command will fail. For more information on mandatory parameters, refer to <xref linkend="mandatory-parameters" />.
fr: S'assurer que tous les paramètres obligatoires pour les divers sous-systèmes sont bien installés avant de copier des paramètres d'un groupe à un autre, sinon la commande échouera. Pour obtenir plus d'informations sur les paramètres obligatoires, se reporter à <xref linkend="mandatory-parameters" />.

source: To set parameters in a cgroup directly, insert values into the relevant subsystem pseudo-file using the <command>echo</command> command. For example, this command inserts the value <literal>0-1</literal> into the <filename>cpuset.cpus</filename> pseudo-file of the cgroup <systemitem>group1</systemitem>:
fr: Pour définir des paramètres dans un groupe de contrôle, insérer les valeurs dans le pseudo-fichier du sous-système correspondant à l'aide de la commande <command>echo</command>. Par exemple, cette commande insère la valeur <literal>0-1</literal> dans le pseudo-fichier <filename>cpuset.cpus</filename> du groupe de contrôle <systemitem>group1</systemitem> :

source: With this value in place, the tasks in this cgroup are restricted to CPUs 0 and 1 on the system.
fr: Avec cette valeur en place, les tâches de ce groupe de contrôle sont restreintes aux CPU 0 et 1 du système.

source: Moving a Process to a Control Group
fr: Déplacer un processus vers un groupe de contrôle

source: Move a process into a cgroup by running the <command>cgclassify</command> command:
fr: On peut aussi déplacer un processus en exécutant la commande <command>cgclassify</command> :

source: The syntax for <command>cgclassify</command> is:
fr: La syntaxe de la commande <command>cgclassify</command> est :

source: <replaceable>subsystems</replaceable> is a comma-separated list of subsystems, or <literal>*</literal> to launch the process in the hierarchies associated with all available subsystems. Note that if cgroups of the same name exist in multiple hierarchies, the <option>-g</option> option moves the processes in each of those groups. Ensure that the cgroup exists within each of the hierarchies whose subsystems you specify here.
fr: <replaceable>subsystems</replaceable> est une liste des sous-systèmes séparés par des virgules, ou <literal>*</literal> pour lancer le processus dans les hiérarchies associées à tous les sous-systèmes disponibles. Remarquer que si des groupes de contrôle du même nom existent dans de multiples hiérarchies, l'option <option>-g</option> déplace les processus dans chacun de ces groupes. S'assurer que le groupe de contrôle existe dans chacune des hiérarchies dont on spécifie ici les sous-systèmes.

source: <replaceable>path_to_cgroup</replaceable> is the path to the cgroup within its hierarchies
fr: <replaceable>path_to_cgroup</replaceable> est le chemin vers le groupe de contrôle dans ses hiérarchies

source: <replaceable>pidlist</replaceable> is a space-separated list of <firstterm>process identifier</firstterm> (PIDs)
fr: <replaceable>pidlist</replaceable> est une liste d'<firstterm>identifiants de processus</firstterm> (ou PID) séparés par des espace

source: You can also add the <option>--sticky</option> option before the <replaceable>pid</replaceable> to keep any child processes in the same cgroup. If you do not set this option and the <application>cgred</application> daemon is running, child processes will be allocated to cgroups based on the settings found in <filename>/etc/cgrules.conf</filename>. The process itself, however, will remain in the cgroup in which you started it.
fr: On peut aussi ajouter l'option <option>-- sticky</option> avant le <replaceable>pid</replaceable> afin de conserver tout processus enfant dans le même groupe de contrôle. Si cette option n'est pas spécifiée et que le démon <application>cgred</application> est en cours d'exécution, les processus enfants seront alloués aux groupes de contrôle selon les paramètres se trouvant dans <filename>/etc/cgrules.conf</filename>. Le processus, quant à lui, restera dans le groupe de contrôle à partir duquel il a été démarré.

source: Using <command>cgclassify</command>, you can move several processes simultaneously. For example, this command moves the processes with PIDs <literal>1701</literal> and <literal>1138</literal> into cgroup <filename>group1/</filename>:
fr: Il est possible de déplacer plusieurs processus simultanément à l'aide de <command>cgclassify</command>. Dans l'exemple qui suit, cette commande déplace les processus avec les PID <literal>1701</literal> et <literal>1138</literal> dans le groupe de contrôle <filename>group1/</filename> :

source: Note that the PIDs to be moved are separated by spaces and that the groups specified should be in different hierarchies.
fr: Remarquer que les PIDs à déplacer sont séparés par des espaces et que les groupes spécifiés doivent être dans différentes hiérarchies.

source: To move a process into a cgroup directly, write its PID to the <filename>tasks</filename> file of the cgroup. For example, to move a process with the PID <literal>1701</literal> into a cgroup at <filename>/cgroup/lab1/group1/</filename>:
fr: Pour déplacer un processus vers un groupe de contrôle, écrire son PID dans le fichier <filename>tasks</filename> du groupe de contrôle. Par exemple, pour déplacer un processus avec le PID <literal>1701</literal> dans un groupe de contrôle sur <filename>/cgroup/lab1/group1/</filename> :

source: The cgred Daemon
fr: Le démon cgred

source: <application>Cgred</application> is a daemon that moves tasks into cgroups according to parameters set in the <filename>/etc/cgrules.conf</filename> file. Entries in the <filename>/etc/cgrules.conf</filename> file can take one of the two forms:
fr: <application>Cgred</application> est un démon qui déplace les tâches dans des groupes de contrôle en fonction des paramètres définis dans le fichier <filename>/etc/cgrules.conf</filename>. Les entrées du fichier <filename>/etc/cgrules.conf</filename> peuvent prendre l'une des formes suivantes :

source: This entry specifies that any processes that belong to the user named <literal>maria</literal> access the devices subsystem according to the parameters specified in the <literal>/usergroup/staff</literal> cgroup. To associate particular commands with particular cgroups, add the <replaceable>command</replaceable> parameter, as follows:
fr: Cette entrée spécifie que tout processus appartenant à l'utilisateur nommé <literal>maria</literal> peut accéder au sous-système des périphériques selon les paramètres spécifiés dans le groupe de contrôle <literal>/usergroup/staff</literal>. Pour associer des commandes particulières à des groupes de contrôle particuliers, ajouter le paramètre <replaceable>command</replaceable> comme suit :

source: The entry now specifies that when the user named <literal>maria</literal> uses the <command>ftp</command> command, the process is automatically moved to the <systemitem>/usergroup/staff/ftp</systemitem> cgroup in the hierarchy that contains the <systemitem>devices</systemitem> subsystem. Note, however, that the daemon moves the process to the cgroup only after the appropriate condition is fulfilled. Therefore, the <command>ftp</command> process might run for a short time in the wrong group. Furthermore, if the process quickly spawns children while in the wrong group, these children might not be moved.
fr: L'entrée spécifie maintenant que lorsque l'utilisateur nommé <literal>maria</literal> utilise la commande <command>ftp</command>, le processus est automatiquement déplacé sur le groupe de contrôle <systemitem>/usergroup/staff/ftp</systemitem> dans la hiérarchie qui contient le sous-système <systemitem>devices</systemitem>. Remarquer cependant que le démon déplace le processus sur le groupe de contrôle uniquement après que la condition appropriée est remplie. Ainsi, le processus <command>ftp</command> peut être exécuté pendant un court moment dans le mauvais groupe. En outre, si le processus génère hâtivement des enfants alors qu'il se trouve dans le mauvais groupe, ces enfants pourraient ne pas être déplacés.

source: Entries in the <filename>/etc/cgrules.conf</filename> file can include the following extra notation:
fr: Les entrées dans le fichier <filename>/etc/cgrules.conf</filename> peuvent inclure les notations supplémentaire suivantes :

source: <literal>@</literal> — when prefixed to <replaceable>user</replaceable>, indicates a group instead of an individual user. For example, <literal>@admins</literal> are all users in the <literal>admins</literal> group.
fr: <literal>@</literal> — en préfixe de <replaceable>user</replaceable>, ceci indique un groupe au lieu d'un utilisateur unique. Par exemple, <literal>@admins</literal> signale tous les utilisateurs faisant partie du groupe <literal>admins</literal>.

source: <literal>*</literal> — represents "all". For example, <literal>*</literal> in the <literal>subsystem</literal> field represents all subsystems.
fr: <literal>*</literal> — signifie "tout". Par exemple, <literal>*</literal> dans le champ <literal>sous-système</literal> représente tous les sous-systèmes.

source: <literal>%</literal> — represents an item the same as the item in the line above. For example:
fr: <literal>%</literal> — représente un élément qui est identique à celui de la ligne du dessus. Par exemple :

source: Starting a Process in a Control Group
fr: Lancer un processus dans un groupe de contrôle

source: Mandatory parameters
fr: Paramètres obligatoires

source: Some subsystems have mandatory parameters that must be set before you can move a task into a cgroup which uses any of those subsystems. For example, before you move a task into a cgroup which uses the <systemitem class="resource">cpuset</systemitem> subsystem, the <filename>cpuset.cpus</filename> and <filename>cpuset.mems</filename> parameters must be defined for that cgroup.
fr: Certains sous-systèmes ont des paramètres à définir obligatoirement avant de déplacer une tâche dans un groupe de contrôle utilisant l'un de ces sous-systèmes. Par exemple, avant de déplacer une tâche dans un groupe de contrôle qui utilise le sous-système <systemitem class="resource">cpuset</systemitem>, les paramètres <filename>cpuset.cpus</filename> et <filename>cpuset.mems</filename> doivent avoir été définis pour ce groupe de contrôle.
