Repository: jfenal-zz/fedora-trans-fr
Catalog: for_translation_resource-management-guide_Subsystems_and_Tunable_Parameters_*.po
Languages: fr

source: Subsystems and Tunable Parameters
fr: Sous-systèmes et paramètres configurables

source: <firstterm>Subsystems</firstterm> are kernel modules that are aware of cgroups. Typically, they are resource controllers that allocate varying levels of system resources to different cgroups. However, subsystems could be programmed for any other interaction with the kernel where the need exists to treat different groups of processes differently. The <firstterm>application programming interface</firstterm> (API) to develop new subsystems is documented in <filename>cgroups.txt</filename> in the kernel documentation, installed on your system at <filename>/usr/share/doc/kernel-doc-<replaceable>kernel-version</replaceable>/Documentation/cgroups/</filename> (provided by the <package>kernel-doc</package> package). The latest version of the cgroups documentation is also available on line at <ulink url="http://www.kernel.org/doc/Documentation/cgroups/cgroups.txt" />. Note, however, that the features in the latest documentation might not match those available in the kernel installed on your system.
fr: Les <firstterm>sous-systèmes</firstterm> sont des modules du noyau prenant en charge les groupes de contrôle (cgroups). Il s'agit typiquement de contrôleurs de ressources qui allouent différents niveaux de ressources système à différents groupes de contrôle. Cependant, les sous-systèmes pourraient être programmés pour toute autre interaction avec le noyau si le besoin de traiter les divers groupes de processus différemment existe. L'<firstterm>interface de programmation</firstterm> (API) servant à développer de nouveaux sous-systèmes est documentée dans <filename>cgroups.txt</filename> dans la documentation du noyau qui est installée sur <filename>/usr/share/doc/kernel-doc-<replaceable>kernel-version</replaceable>/Documentation/cgroups/</filename> (fourni par le paquetage <package>kernel-doc</package>). La version la plus récente de la documentation des groupes de contrôle est disponible en ligne à l'adresse suivante : <ulink url="http://www.kernel.org/doc/Documentation/cgroups/cgroups.txt" />. On remarque cependant que les fonctionnalités décrites dans les documents les plus récents pourraient ne pas correspondre à celles qui sont disponibles dans le noyau installé sur votre système.

source: <firstterm>State objects</firstterm> that contain the subsystem parameters for a cgroup are represented as <firstterm>pseudofiles</firstterm> within the cgroup virtual file system. These pseudo-files can be manipulated by shell commands or their equivalent system calls. For example, <filename>cpuset.cpus</filename> is a pseudo-file that specifies which CPUs a cgroup is permitted to access. If <systemitem>/cgroup/cpuset/webserver</systemitem> is a cgroup for the web server that runs on a system, and we run the following command:
fr: Les <firstterm>objets d'état</firstterm> qui contiennent les paramètres de sous-système pour un groupe de contrôle (cgroup) sont représentés en tant que <firstterm>pseudo-fichiers</firstterm> dans le système de fichiers virtuel du groupe de contrôle. Ces pseudo-fichiers peuvent être manipulés à l'aide de commandes shell ou des appels système équivalents. Par exemple, <filename>cpuset.cpus</filename> est un pseudo-fichier qui spécifie à quels CPUs un groupe de contrôle peut accéder. Si <systemitem>/cgroup/cpuset/webserver</systemitem> est un groupe de contrôle pour le serveur web exécuté sur un système et que nous exécutons la commande suivante :

source: The value <literal>0,2</literal> is written to the <filename>cpuset.cpus</filename> pseudofile and therefore limits any tasks whose PIDs are listed in <filename>/cgroup/cpuset/webserver/tasks</filename> to use only CPU&nbsp;0 and CPU&nbsp;2 on the system.
fr: La valeur <literal>0,2</literal> est écrite sur le pseudofichier <filename>cpuset.cpus</filename> et limite ainsi toutes les tâches dont les PID sont répertoriés sur <filename>/cgroup/cpuset/webserver/tasks</filename> afin d'uniquement utiliser CPU&nbsp;0 et CPU&nbsp;2 sur le système.

source: The Block I/O (<systemitem>blkio</systemitem>) subsystem controls and monitors access to I/O on block devices by tasks in cgroups. Writing values to some of these pseudofiles limits access or bandwidth, and reading values from some of these pseudofiles provides information on I/O operations.
fr: Le sous-système Block I/O (<systemitem>blkio</systemitem>) surveille et contrôle l'accès des tâches de groupes de contrôle aux E/S sur des périphériques blocs. L'écriture de valeurs sur certains de ces pseudo-fichiers limite l'accès ou la bande passante, la lecture des valeurs de certains de ces pseudos-fichiers fournit des informations sur les opérations d'E/S.

source: The <systemitem>blkio</systemitem> subsystem offers two policies for controlling access to I/O:
fr: Le sous-système <systemitem>blkio</systemitem> offre deux politiques pour contrôler l'accès aux entrées/sorties :

source: <emphasis>Proportional weight division</emphasis> &mdash; implemented in the Completely Fair Queuing I/O scheduler, this policy allows you to set weights to specific cgroups. This means that each cgroup has a set percentage (depending on the weight of the cgroup) of all I/O operations reserved. For more information, refer to <xref linkend="blkio-weight" />
fr: <emphasis>Répartition proportionnelle pondérée</ emphasis> &mdash; mise en œuvre dans l'ordonnanceur d'entrées/sorties Completely Fair Queuing, cette politique permet de définir des poids sur des cgroups spécifiques. Cela signifie que chaque cgroup dispose d'une portion (en fonction du poids du cgroup) de toutes les opérations d'entrées/sorties réservés. Pour plus d'informations, se reporter à <xref linkend="blkio-weight" />

source: <emphasis>I/O throttling (Upper limit)</emphasis> &mdash; used to set an upper limit for the number of I/O operations performed by a specific device. This means that a device can have a limited rate of <emphasis>read</emphasis> or <emphasis>write</emphasis> operations. For more information, refer to <xref linkend="blkio-throttling" />
fr: <emphasis>Limitation d'entrées/sorties (limite supérieure)</emphasis> &mdash; utilisé pour définir unelimite supérieure pour le nombre de opérations d'entrées/sorties exécutées par un périphérique spécifique.Cela signifie qu'un périphérique peut avoir un taux limité d'opérations en <emphasis>lecture</ emphasis> ou en <emphasis>écriture</ emphasis>. Pour de plus amples d'informations, se reporter à <xref linkend="blkio-throttling" />

source: Buffered <emphasis>write</emphasis> operations
fr: Les opérations d'<emphasis>écriture</emphasis> en mémoire tampon

source: Currently, the Block I/O subsystem does not work for buffered <emphasis>write</emphasis> operations. It is primarily targeted at direct I/O, although it works for buffered <emphasis>read</emphasis> operations.
fr: Actuellement, le sous-système d'E/S en mode bloc ne fonctionne pas pour les opérations en <emphasis>écriture</emphasis> passant par la mémoire tampon. Il est principalement destiné aux E/S directes, bien qu'il fonctionne pour les opérations en <emphasis>lecture</emphasis> tamponnées.

source: Proportional Weight Division Configuration Options
fr: Options de configuration de la répartition proportionnelle pondérée

source: specifies the relative proportion (<firstterm>weight</firstterm>) of block I/O access available by default to a cgroup, in the range <literal>100</literal> to <literal>1000</literal>. This value is overridden for specific devices by the <filename>blkio.weight_device</filename> parameter. For example, to assign a default weight of <literal>500</literal> to a cgroup for access to block devices, run:
fr: spécifie la proportion relative (<firstterm>poids</firstterm>) de l'accès de Block I/O disponible par défaut à un groupe de contrôle dans une gamme de <literal>100</literal> à <literal>1000</literal>. Cette valeur est remplacée par le paramètre <filename>blkio.weight_device</filename> pour des périphériques spécifiques. Par exemple, pour assigner un poids par défaut de <literal>500</literal> à un groupe de contrôle pour accéder aux périphériques blocs, exécuter :

source: specifies the relative proportion (<firstterm>weight</firstterm>) of I/O access on specific devices available to a cgroup, in the range <literal>100</literal> to <literal>1000</literal>. The value of this parameter overrides the value of the <filename>blkio.weight</filename> parameter for the devices specified. Values take the format <replaceable>major</replaceable>:<replaceable>minor</replaceable>&nbsp;<replaceable>weight</replaceable>, where <replaceable>major</replaceable> and <replaceable>minor</replaceable> are device types and node numbers specified in <citetitle>Linux Allocated Devices</citetitle>, otherwise known as the <citetitle>Linux Devices List</citetitle> and available from <ulink url="http://www.kernel.org/doc/Documentation/devices.txt" />. For example, to assign a weight of <literal>500</literal> to a cgroup for access to <systemitem>/dev/sda</systemitem>, run:
fr: spécifie la proportion relative (<firstterm>poids</firstterm>) de l'accès des E/S à un groupe de contrôle sur des périphériques spécifiques dans la gamme de <literal>100</literal> à <literal>1000</literal>. La valeur de ce paramètre remplace la valeur du paramètre <filename>blkio.weight</filename> pour des périphériques spécifiés. Les valeurs prennent le format <replaceable>majeur</replaceable>:<replaceable>mineur</replaceable>&nbsp;<replaceable>poids</replaceable>, où <replaceable>majeur</replaceable> et <replaceable>mineur</replaceable> sont des types de périphériques et des numéros de noeuds spécifiés dans les <citetitle>périphériques alloués de Linux</citetitle>, aussi connus sous le nom de <citetitle>Liste des périphériques Linux</citetitle> et disponible sur <ulink url="http://www.kernel.org/doc/Documentation/devices.txt" />. Par exemple, pour assigner un poids de <literal>500</literal> à un groupe de contrôle pour accéder à <systemitem>/dev/sda</systemitem>, exécuter :

source: In the <citetitle>Linux Allocated Devices</citetitle> notation, <literal>8:0</literal> represents <systemitem>/dev/sda</systemitem>.
fr: Dans la notation des <citetitle>périphériques alloués de Linux</citetitle>, <literal>8:0</literal> représente <systemitem>/dev/sda</systemitem>.

source: reports the time that a cgroup had I/O access to specific devices. Entries have three fields: <replaceable>major</replaceable>, <replaceable>minor</replaceable>, and <replaceable>time</replaceable>. <replaceable>Major</replaceable> and <replaceable>minor</replaceable> are device types and node numbers specified in <citetitle>Linux Allocated Devices</citetitle>, and <replaceable>time</replaceable> is the length of time in milliseconds (ms).
fr: rapporte le moment auquel un groupe de contrôle possédait un accès d'E/S à des périphériques spécifiques. Les entrées possèdent trois champs : <replaceable>majeur</replaceable>, <replaceable>mineur</replaceable> et <replaceable>durée</replaceable>. <replaceable>Majeur</replaceable> et <replaceable>mineur</replaceable> sont des types de périphériques et des numéros de noeuds spécifiés dans les <citetitle>périphériques alloués de Linux</citetitle> et <replaceable>durée</replaceable> est la durée en millisecondes (ms).

source: reports the number of sectors transferred to or from specific devices by a cgroup. Entries have three fields: <replaceable>major</replaceable>, <replaceable>minor</replaceable>, and <replaceable>sectors</replaceable>. <replaceable>Major</replaceable> and <replaceable>minor</replaceable> are device types and node numbers specified in <citetitle>Linux Allocated Devices</citetitle>, and <replaceable>sectors</replaceable> is the number of disk sectors.
fr: rapporte le nombre de secteurs transférés depuis ou vers des périphériques spécifiques d'un groupe de contrôle. Les entrées possèdent trois champs : <replaceable>majeur</replaceable>, <replaceable>mineur</replaceable> et <replaceable>secteurs</replaceable>. <replaceable>Majeur</replaceable> et <replaceable>mineur</replaceable> sont des types de périphériques et des numéros de noeuds spécifiés dans les <citetitle>périphériques alloués de Linux</citetitle> et <replaceable>secteurs</replaceable> est le nombre de secteurs du disque.

source: reports the number of I/O operations performed on specific devices by a cgroup as seen by the CFQ scheduler. Entries have four fields: <replaceable>major</replaceable>, <replaceable>minor</replaceable>, <replaceable>operation</replaceable>, and <replaceable>number</replaceable>. <replaceable>Major</replaceable> and <replaceable>minor</replaceable> are device types and node numbers specified in <citetitle>Linux Allocated Devices</citetitle>, <replaceable>operation</replaceable> represents the type of operation (<literal>read</literal>, <literal>write</literal>, <literal>sync</literal>, or <literal>async</literal>) and <replaceable>number</replaceable> represents the number of operations.
fr: rapporte le nombre d'opérations d'E/S effectuées sur des périphériques spécifiques par un groupe de contrôle comme vu par l'ordonnanceur CFQ. Les entrées possèdent quatre champs : <replaceable>majeur</replaceable>, <replaceable>mineur</replaceable>, <replaceable>opération</replaceable> et <replaceable>octets</replaceable>. <replaceable>Majeur</replaceable> et <replaceable>mineur</replaceable> sont les types de périphériques et numéros de noeuds spécifiés dans les <citetitle>périphériques alloués de Linux</citetitle>, <replaceable>opération</replaceable> représente le type d'opération (<literal>lecture</literal>, <literal>écriture</literal>, <literal>sync</literal> ou <literal>async</literal>) et <replaceable>nombre</replaceable> représente le nombre d'opérations.

source: reports the number of bytes transferred to or from specific devices by a cgroup as seen by the CFQ scheduler. Entries have four fields: <replaceable>major</replaceable>, <replaceable>minor</replaceable>, <replaceable>operation</replaceable>, and <replaceable>bytes</replaceable>. <replaceable>Major</replaceable> and <replaceable>minor</replaceable> are device types and node numbers specified in <citetitle>Linux Allocated Devices</citetitle>, <replaceable>operation</replaceable> represents the type of operation (<literal>read</literal>, <literal>write</literal>, <literal>sync</literal>, or <literal>async</literal>) and <replaceable>bytes</replaceable> is the number of bytes transferred.
fr: rapporte le nombre d'octets transférés depuis ou vers des périphériques spécifiques par un groupe de contrôle comme vu par l'ordonnanceur CFQ. Les entrées possèdent quatre champs : <replaceable>majeur</replaceable>, <replaceable>mineur</replaceable>, <replaceable>opération</replaceable> et <replaceable>octets</replaceable>. <replaceable>Majeur</replaceable> et <replaceable>mineur</replaceable> sont les types de périphériques et des numéros de noeuds spécifiés dans les <citetitle>périphériques alloués de Linux</citetitle>, <replaceable>opération</replaceable> représente le type d'opération (<literal>lecture</literal>, <literal>écriture</literal>, <literal>sync</literal> ou <literal>async</literal>) et <replaceable>octets</replaceable> est le nombre d'octets transférés.

source: reports the total time between request dispatch and request completion for I/O operations on specific devices by a cgroup as seen by the CFQ scheduler. Entries have four fields: <replaceable>major</replaceable>, <replaceable>minor</replaceable>, <replaceable>operation</replaceable>, and <replaceable>time</replaceable>. <replaceable>Major</replaceable> and <replaceable>minor</replaceable> are device types and node numbers specified in <citetitle>Linux Allocated Devices</citetitle>, <replaceable>operation</replaceable> represents the type of operation (<literal>read</literal>, <literal>write</literal>, <literal>sync</literal>, or <literal>async</literal>) and <replaceable>time</replaceable> is the length of time in nanoseconds (ns). The time is reported in nanoseconds rather than a larger unit so that this report is meaningful even for solid-state devices.
fr: rapporte la totalité du temps pris entre l'envoi de la demande et l'achèvement de celle-ci pour des opérations d'E/S sur des périphériques spécifiques par un groupe de contrôle comme vu par l'ordonnanceur CFQ. Les entrées possèdent quatre champs : <replaceable>majeur</replaceable>, <replaceable>mineur</replaceable>, <replaceable>opération</replaceable> et <replaceable>octets</replaceable>. <replaceable>Majeur</replaceable> et <replaceable>mineur</replaceable> sont les types de périphériques et numéros de noeuds spécifiés dans les <citetitle>périphériques alloués de Linux</citetitle>, <replaceable>opération</replaceable> représente le type d'opération (<literal>lecture</literal>, <literal>écriture</literal>, <literal>sync</literal>, ou <literal>async</literal>) et <replaceable>durée</replaceable> représente la durée en nanosecondes (ns). La durée rapportée utilise des nanosecondes plutôt qu'une unité plus importante afin que ce rapport puisse être utile même lors de l'utilisation de périphériques SSD.

source: reports the total time I/O operations on specific devices by a cgroup spent waiting for service in the scheduler queues. When you interpret this report, note:
fr: rapporte le temps total attendu pour un service dans les files d'attente des opérations d'E/S sur des périphériques spécifiques d'un groupe de contrôle. Lorsque l'on interpréte ce rapport, on remarque que :

source: the time reported can be greater than the total time elapsed, because the time reported is the cumulative total of all I/O operations for the cgroup rather than the time that the cgroup itself spent waiting for I/O operations. To find the time that the group as a whole has spent waiting, use the <filename>blkio.group_wait_time</filename> parameter.
fr: le temps rapporté peut être plus important que la totalité du temps écoulé car le temps rapporté est le total cumulé des toutes les opérations d'E/S pour le groupe de contrôle plutôt que le temps que le groupe de contrôle a lui-même attendu pour les opérations d'E/S. Pour obtenir le temps pendant lequel le groupe en tant que tel a dû attendre, utiliser <filename>blkio.group_wait_time</filename>.

source: if the device has a <envar>queue_depth</envar> &gt; 1, the time reported only includes the time until the request is dispatched to the device, not any time spent waiting for service while the device re-orders requests.
fr: si <envar>queue_depth</envar> &gt; 1 (sur le périphérique), alors la durée rapportée inclut uniquement le temps attendu jusqu'à ce que la requête soit envoyée au périphérique, et pas le temps attendu pour le service pendant que le périphériques effectuait de nouvelles commandes de requêtes.

source: Entries have four fields: <replaceable>major</replaceable>, <replaceable>minor</replaceable>, <replaceable>operation</replaceable>, and <replaceable>time</replaceable>. <replaceable>Major</replaceable> and <replaceable>minor</replaceable> are device types and node numbers specified in <citetitle>Linux Allocated Devices</citetitle>, <replaceable>operation</replaceable> represents the type of operation (<literal>read</literal>, <literal>write</literal>, <literal>sync</literal>, or <literal>async</literal>) and <replaceable>time</replaceable> is the length of time in nanoseconds (ns). The time is reported in nanoseconds rather than a larger unit so that this report is meaningful even for solid-state devices.
fr: Les entrées possèdent quatre champs : <replaceable>majeur</replaceable>, <replaceable>mineur</replaceable>, <replaceable>opération</replaceable> et <replaceable>octets</replaceable>. <replaceable>Majeur</replaceable> et <replaceable>mineur</replaceable> sont les types de périphériques et numéros de noeuds spécifiés dans les <citetitle>périphériques alloués de Linux</citetitle>, <replaceable>opération</replaceable> (<literal>lecture</literal>, <literal>écriture</literal>, <literal>sync</literal> ou <literal>async</literal>) et <replaceable>durée</replaceable> est la durée en nanosecondes (ns). La durée rapportée utilise des nanosecondes plutôt qu'une unité plus importante afin que ce rapport puisse être utile même pour des périphériques SSD.

source: reports the number of BIOS requests merged into requests for I/O operations by a cgroup. Entries have two fields: <replaceable>number</replaceable> and <replaceable>operation</replaceable>. <replaceable>Number</replaceable> is the number of requests, and <replaceable>operation</replaceable> represents the type of operation (<literal>read</literal>, <literal>write</literal>, <literal>sync</literal>, or <literal>async</literal>).
fr: rapporte le nombre de requêtes BIOS fusionnées en requêtes pour des opérations d'E/S d'un groupe de contrôle. Les entrées possèdent deux champs : <replaceable>nombre</replaceable> et <replaceable>opération</replaceable>. <replaceable>Nombre</replaceable> est le nombre de requêtes et <replaceable>opération</replaceable> représente le type d'opération (<literal>lecture</literal>, <literal>écriture</literal>, <literal>sync</literal>, ou <literal>async</literal>).

source: reports the number of requests queued for I/O operations by a cgroup. Entries have two fields: <replaceable>number</replaceable> and <replaceable>operation</replaceable>. <replaceable>Number</replaceable> is the number of requests, and <replaceable>operation</replaceable> represents the type of operation (<literal>read</literal>, <literal>write</literal>, <literal>sync</literal>, or <literal>async</literal>).
fr: rapporte le nombre de requêtes en file d'attente pour des opérations d'E/S d'un groupe de contrôle. Les entrées possèdent deux champs : <replaceable>nombre</replaceable> et <replaceable>opération</replaceable>. <replaceable>Nombre</replaceable> est le nombre de requêtes et <replaceable>opération</replaceable> représente le type d'opération (<literal>lecture</literal>, <literal>écriture</literal>, <literal>sync</literal> ou <literal>async</literal>).

source: reports the average queue size for I/O operations by a cgroup, over the entire length of time of the group's existence. The queue size is sampled every time a queue for this cgroup gets a timeslice. Note that this report is available only if <literal>CONFIG_DEBUG_BLK_CGROUP=y</literal> is set on the system.
fr: rapporte la taille moyenne des files d'attente pour des opérations d'E/S d'un groupe de contrôle sur la durée totale de l'existance du groupe. La taille de la file d'attente est échantillonnée chaque fois qu'une file d'attente de ce groupe de contrôle obtient une tranche de temps. On remarque que ce rapport est uniquement disponible si <literal>CONFIG_DEBUG_BLK_CGROUP=y</literal> est activé sur le système.
