Repository: jfenal-zz/fedora-trans-fr
Catalog: for_translation_resource-management-guide_Subsystems_and_Tunable_Parameters_*.po
Languages: fr

source: The Network Priority (<systemitem>net_prio</systemitem>) subsystem provides a way to dynamically set the priority of network traffic per each network interface for applications within various cgroups. A network's priority is a number assigned to network traffic and used internally by the system and network devices. Network priority is used to differentiate packets that are sent, queued, or dropped. The <command>tc</command> command may be used to set a network's priority (setting the network priority via the <command>tc</command> command is outside the scope of this guide; for more information, refer to the <command>tc</command> man page).
fr: Le sous-système priorisation réseau (<systemitem>net_prio</systemitem>) fournit un moyen de définir dynamiquement la priorité du trafic réseau pour chaque interface réseau pour les applications placées dans divers cgroups. La priorité réseau est un nombre assigné au trafic réseau et utilisé en interne par le système et les interfaces réseau. La priorité réseau est utilisée pour différencier les paquets qui sont envoyé, en attente, ou abandonnés (dropped). La commande <command>tc</command> peut être utilisée pour définir une priorité réseau (l'utilisation de <command>tc</command> pour définir la priorité réseau est en dehors du champ d'application de ce guide ; pour plus d'informations, se reporter à la plage de manuel de <command>tc</command>).

source: Typically, an application sets the priority of its traffic via the <systemitem>SO_PRIORITY</systemitem> socket option. However, applications are often not coded to set the priority value, or the application's traffic is site-specific and does not provide a defined priority.
fr: En général, une application définit la priorité de son trafic via l'option de socket <systemitem>SO_PRIORITY</systemitem>. Toutefois, les applicationsne sont pas souvent codés pour définir la valeur de priorité, ou alors le trafic de l'application est spécifique au site et ne fournit pas une priorité définie.

source: Using the <systemitem>net_prio</systemitem> subsystem in a cgroup allows an administrator to assign a process to a specific cgroup which defines the priority of outgoing traffic on a given network interface:
fr: L'utilisation du sous-système <systemitem>net_prio</systemitem> dans un cgroup permet à un administrateur d'attribuer un processus à un cgroup spécifique qui définit la priorité de trafic sortant sur une interface de réseau donnée :

source: In order to use the <systemitem>net_prio</systemitem> subsystem, you must have the following kernel configuration option set:
fr: Afin d'utiliser le sous-système <systemitem>net_prio</systemitem>, l'option de configuration doit avoir été positionnée :

source: You must have the <systemitem>netprio_cgroup</systemitem> module loaded in the kernel. To do this execute the following command:
fr: Le module <systemitem>netprio_cgroup</systemitem> doit être chargé dansle noyau. Pour ce faire, lancer la commande suivante :

source: To check whether the <systemitem>netprio_cgroup</systemitem> module is loaded, execute the following command:
fr: Pour vérifier si le module <systemitem>netprio_cgroup</systemitem> estchargé, lancer la commande suivante :

source: Once the <systemitem>net_prio</systemitem> subsystem is enabled, it is visible in the list in the <filename>/proc/cgroups</filename> file.
fr: Une fois le sous-système <systemitem>net_prio</systemitem> activé, il estvisible dans la liste dans le fichier <filename>/proc/cgroups</filename>.

source: a read-only file which contains a unique integer value that the kernel uses as an internal representation of this cgroup.
fr: fichier en lecture seule contenant une valeur entière unique que le noyau utilise comme représentation interne de ce cgroup.

source: contains a map of priorities assigned to traffic originating from processes in this group and leaving the system on various interfaces. This map is represented by a list of pairs in the form <parameter><replaceable>&lt;network_interface&gt;</replaceable> <replaceable>&lt;priority&gt;</replaceable></parameter>:
fr: contient une carte des priorités assignées au trafic provenant de processusdans ce groupe et sortant du système sur différentes interfaces. Cette carte est représentée par une liste de paires sous la forme <parameter><replaceable>&lt;interface_reseau&gt;</replaceable> <replaceable>&lt;priorite&gt;</replaceable></parameter>:

source: Contents of the <filename>net_prio.ifpriomap</filename> file can be modified by echoing a string into the file using the above format, for example:
fr: Le contenu du fichier <filename>net_prio.ifpriomap</filename> peut être modifié en faisant écrivant une chaîne dans le fichier en utilisant le format ci-dessus, par exemple :

source: The above command forces any traffic originating from processes belonging to the <systemitem>iscsi</systemitem> <systemitem>net_prio</systemitem> cgroup, and with traffic outgoing on the <systemitem>eth0</systemitem> network interface, to have the priority set to the value <constant>5</constant>. The parent cgroup also has a writable <filename>net_prio.ifpriomap</filename> file that can be used to set a system default priority.
fr: La commande ci-dessus oblige tout le trafic provenant de processus appartenant aux cgroup <systemitem>iscsi</systemitem> <systemitem>net_prio</systemitem>, dont le trafic sortant par l'interface réseau <systemitem>eth0</systemitem> d'avoir une priorité fixée à <constant>5</constant>. Le cgroup parent dispose également d'un fichier accessible en écriture <filename>net_prio.ifpriomap</filename> pouvant être utilisé pour définir la priorité par défaut du système.

source: The <systemitem>ns</systemitem> subsystem provides a way to group processes into separate <firstterm>namespaces</firstterm>. Within a particular namespace, processes can interact with each other but are isolated from processes running in other namespaces. These separate namespaces are sometimes referred to as <firstterm>containers</firstterm> when used for operating-system-level virtualization.
fr: Le sous-système <systemitem>ns</systemitem> fournit une manière de grouper les processus dans des <firstterm>espaces de noms</firstterm> (<firstterm>namespaces</firstterm>) séparés. Dans un espace de nom particulier, les processus peuvent interagir ensemble mais sont isolés des processus exécutés dans d'autres espaces de noms. Ces autres espaces de noms sont parfois appelés des <firstterm>conteneurs</firstterm> (<firstterm>containers</firstterm>) lors de leur utilisation pour une virtualisation au niveau du système d'exploitation.

source: Additional Resources
fr: Ressources supplémentaires

source: Subsystem-Specific Kernel Documentation
fr: Documentation sur les noyaux spécifiques aux sous-systèmes

source: All of the following files are located under the <filename class="directory">/usr/share/doc/kernel-doc-<replaceable>&lt;kernel_version&gt;</replaceable>/Documentation/cgroups/</filename> directory (provided by the <package>kernel-doc</package> package).
fr: Tous les fichiers suivants se trouvent sous le répertoire <filename class="directory">/usr/share/doc/kernel-doc-<replaceable>&lt;kernel_version&gt;</replaceable>/Documentation/cgroups/</filename> (fournit par le paquetage <package>kernel-doc</package>).

source: <systemitem class="resource">blkio</systemitem> subsystem — <filename>blkio-controller.txt</filename>
fr: Sous-système <systemitem class="resource">blkio</systemitem> — <filename>blkio-controller.txt</filename>

source: <systemitem class="resource">cpuacct</systemitem> subsystem — <filename>cpuacct.txt</filename>
fr: Sous-système <systemitem class="resource">cpuacct</systemitem> — <filename>cpuacct.txt</filename>

source: <systemitem class="resource">cpuset</systemitem> subsystem — <filename>cpusets.txt</filename>
fr: Sous-système <systemitem class="resource">cpuset</systemitem> — <filename>cpusets.txt</filename>

source: <systemitem class="resource">devices</systemitem> subsystem — <filename>devices.txt</filename>
fr: Sous-système <systemitem class="resource">devices</systemitem> — <filename>devices.txt</filename>

source: <systemitem class="resource">freezer</systemitem> subsystem — <filename>freezer-subsystem.txt</filename>
fr: Sous-système <systemitem class="resource">freezer</systemitem> — <filename>freezer-subsystem.txt</filename>

source: <systemitem class="resource">memory</systemitem> subsystem — <filename>memory.txt</filename>
fr: Sous-système <systemitem class="resource">memory</systemitem> — <filename>memory.txt</filename>

source: <systemitem class="resource">net_prio</systemitem> subsystem &mdash; <filename>net_prio.txt</filename>
fr: sous-système <systemitem class="resource">net_prio</systemitem> &mdash; <filename>net_prio.txt</filename>
