Repository: jfenal-zz/fedora-trans-fr
Catalog: for_translation_resource-management-guide_Introduction_to_Control_Groups_*.po
Languages: fr

source: Conversely, if the need for splitting subsystems among separate hierarchies is reduced, you can remove a hierarchy and attach its subsystems to an existing one.
fr: À l'inverse, si le besoin de diviser des sous-systèmes entre différentes hiérarchies est réduit, vous pouvez supprimer une hiérarchie et attacher ses sous-systèmes à une autre hiérarchie existante.

source: The design allows for simple cgroup usage, such as setting a few parameters for specific tasks in a single hierarchy, such as one with just the <systemitem>cpu</systemitem> and <systemitem>memory</systemitem> subsystems attached.
fr: La conception permet une utilisation simple de cgroup, comme la définition de quelques paramètres pour des tâches spécifiques dans une hiérarchie unique, par exemple juste sur les sous-systèmes <systemitem>cpu</systemitem> et <systemitem>memory</systemitem> qui lui sont attachés.

source: The design also allows for highly specific configuration: each task (process) on a system could be a member of each hierarchy, each of which has a single attached subsystem. Such a configuration would give the system administrator absolute control over all parameters for every single task.
fr: Le design permet aussi de réaliser des configurations hautement spécifiques : chaque tâche (ou processus) sur un système peut être membre de chaque hiérarchie, qui elles-mêmes ne possèdent qu'un seul sous-système attaché. Une telle configuration pourrait ainsi offrir à un administrateur système un contrôle absolu sur tous les paramètres de chaque tâche.
