Repository: jfenal-zz/fedora-trans-fr
Catalog: for_translation_resource-management-guide_Using_Control_Groups_*.po
Languages: fr

source: The examples in this section illustrate the correct syntax for the command, but only work on systems on which the relevant mandatory parameters have been set for any controllers used in the examples. If you have not already configured the relevant controllers, you cannot copy example commands directly from this section and expect them to work on your system.
fr: Les exemples de cette section illustrent la syntaxe correcte pour la commande, mais ne fonctionnent que sur les systèmes sur lesquels les paramètres obligatoires ont été définis pour chacun des contrôleurs utilisés dans les exemples. Si les contrôleurs appropriés n'ont pas été configurés préalablement, il ne sera pas possible de recopier les commandes d'exemple directement depuis cette section et espérer les voir fonctionner sur un système.

source: Refer to <xref linkend="ch-Subsystems_and_Tunable_Parameters" /> for a description of which parameters are mandatory for given subsystems.
fr: Se reporter à <xref linkend="ch-Subsystems_and_Tunable_Parameters" /> pour obtenir une description des paramètres obligatoires pour un sous-système donné.

source: Launch processes in a cgroup by running the <command>cgexec</command> command. For example, this command launches the <application>lynx</application> web browser within the <systemitem>group1</systemitem> cgroup, subject to the limitations imposed on that group by the <systemitem>cpu</systemitem> subsystem:
fr: Il est aussi possible de lancer des processus dans un groupe de contrôle en exécutant la commande <command>cgexec</command>. Par exemple, cette commande lance le navigateur web <application>lynx</application> dans le groupe de contrôle <systemitem>group1</systemitem>, assujetti à toutes les limitations imposées par le sous-système <systemitem>cpu</systemitem> :

source: The syntax for <command>cgexec</command> is:
fr: La syntaxe de la commande <command>cgexec</command> est :

source: <replaceable>subsystems</replaceable> is a comma-separated list of subsystems, or <literal>*</literal> to launch the process in the hierarchies associated with all available subsystems. Note that, as with <command>cgset</command> described in <xref linkend="Setting_Parameters" />, if cgroups of the same name exist in multiple hierarchies, the <option>-g</option> option creates processes in each of those groups. Ensure that the cgroup exists within each of the hierarchies whose subsystems you specify here.
fr: <replaceable>subsystems</replaceable> est soit une liste des sous-systèmes séparés par des virgules, soit <literal>*</literal> qui sert à lancer le processus dans les hiérarchies associées à tous les sous-systèmes disponibles. Remarquer que comme pour <command>cgset</command>, qui est décrit dans la <xref linkend="Setting_Parameters" />, si des groupes de contrôle de même nom existent dans de multiples hiérarchies, l'option <option>-g</option> crée des processus dans chacun de ces groupes. S'assurer que le groupe de contrôle existe bien dans chacune des hiérarchies dont on spécifie les sous-systèmes.

source: <replaceable>path_to_cgroup</replaceable> is the path to the cgroup relative to the hierarchy.
fr: <replaceable>path_to_cgroup</replaceable> est le chemin d'accès vers le groupe de contrôle relatif à la hiérarchie.

source: <replaceable>command</replaceable> is the command to run.
fr: <replaceable>command</replaceable> est la commande à lancer.

source: <replaceable>arguments</replaceable> are any arguments for the command.
fr: <replaceable>arguments</replaceable> représente tout argument de la commande

source: You can also add the <option>--sticky</option> option before the <replaceable>command</replaceable> to keep any child processes in the same cgroup. If you do not set this option and the <application>cgred</application> daemon is running, child processes will be allocated to cgroups based on the settings found in <filename>/etc/cgrules.conf</filename>. The process itself, however, will remain in the cgroup in which you started it.
fr: Il est aussi possible d'ajouter l'option <option>--sticky</option> avant <replaceable>command</replaceable> afin de conserver tout processus enfant dans le même groupe de contrôle. Si cette option n'est pas positionnée et que le démon <application>cgred</application> est en cours d'exécution, les processus enfants seront alloués aux groupes de contrôle en fonction des paramètres trouvés sur <filename>/etc/cgrules.conf</filename>. Le processus lui-même restera toutefois dans le groupe de contrôle à partir duquel il a été démarré.

source: When you start a new process, it inherits the group of its parent process. Therefore, an alternative method for starting a process in a particular cgroup is to move your shell process to that group (refer to <xref linkend="sec-Moving_a_Process_to_a_Control_Group" />), and then launch the process from that shell. For example:
fr: Lorsqu'un nouveau processus est lancé, il hérite du groupe de son processus parent. Ainsi, déplacer votre processus shell sur un groupe de contrôle puis lancer le processus à partir de ce shell constitue une variante pour démarrer un processus dans un groupe de contrôle particulier (se reporter à <xref linkend="sec-Moving_a_Process_to_a_Control_Group" />). Par exemple :

source: Note that after exiting <application>lynx</application>, your existing shell is still in the <systemitem>group1</systemitem> cgroup. Therefore, an even better way would be:
fr: Remarquer qu'après la fermeture de <application>lynx</application>, le shell existant se trouve toujours dans le groupe de contrôle <systemitem>group1</systemitem>. Ainsi, la méthode suivante est préférable :

source: Starting a Service in a Control Group
fr: Lancer un service dans un groupe de contrôle

source: You can start certain services in a cgroup. Services that can be started in cgroups must:
fr: Il est possible de démarrer certains services dans un groupe de contrôle. Les services pouvant être démarrés dans des groupes de contrôle doivent :

source: use a <filename>/etc/sysconfig/<replaceable>servicename</replaceable></filename> file
fr: utiliser un fichier <filename>/etc/sysconfig/<replaceable>servicename</replaceable></filename>

source: use the <literal>daemon()</literal> function from <filename>/etc/init.d/functions</filename> to start the service
fr: utiliser la fonction <literal>daemon()</literal> depuis <filename>/etc/init.d/functions</filename> pour démarrer le service

source: To make an eligible service start in a cgroup, edit its file in the <filename>/etc/sysconfig</filename> directory to include an entry in the form <literal>CGROUP_DAEMON="<replaceable>subsystem</replaceable>:<replaceable>control_group</replaceable>"</literal> where <replaceable>subsystem</replaceable> is a subsystem associated with a particular hierarchy, and <replaceable>control_group</replaceable> is a cgroup in that hierarchy. For example:
fr: Pour lancer un service dans un groupe de contrôle, modifier son fichier dans le répertoire <filename>/etc/sysconfig</filename> de manière à inclure une entrée sous la forme <literal>CGROUP_DAEMON="<replaceable>subsystem</replaceable>:<replaceable>control_group</replaceable>"</literal>, où <replaceable>subsystem</replaceable> est un sous-système associé à une hiérarchie particulière, et où <replaceable>control_group</replaceable> est un groupe de contrôle dans cette hiérarchie. Par exemple :

source: Process Behavior in the Root Control Group
fr: Comportement d'un processus dans le groupe de contrôle racine

source: Certain <systemitem class="resource">blkio</systemitem> and <systemitem class="resource">cpu</systemitem> configuration options affect processes (tasks) running in the root cgroup in a different way than those in a subgroup. Consider the following example:
fr: Certaines options de configuration <systemitem class="resource">blkio</systemitem> et <systemitem class="resource">cpu</systemitem> affectent les processus (tâches) tournant dans le cgroup racine différemment de ceux dans un sous-groupe. Si l'on considère l'exemple suivant :

source: Create two subgroups under one root group: <filename>/rootgroup/red/</filename> and <filename>/rootgroup/blue/</filename>
fr: Créer deux sous-groupes sous un groupe racine : <filename>/rootgroup/red/</filename> et <filename>/rootgroup/blue/</filename>

source: In each subgroup and in the root group, define the <filename>cpu.shares</filename> configuration option and set it to <literal>1</literal>.
fr: Dans chaque sous-groupe et dans le groupe racine, définir l'option de configuration <filename>cpu.shares</filename> à <literal>1</literal>.

source: In the scenario configured above, one process placed in each group (that is, one task in <filename>/rootgroup/tasks</filename>, <filename>/rootgroup/red/tasks</filename> and <filename>/rootgroup/blue/tasks</filename>) ends up consuming 33.33% of the CPU:
fr: Dans le scénario ci-dessus, un processus placé dans chaque groupe (i.e, une tâche dans <filename>/rootgroup/tasks</filename>, dans <filename>/rootgroup/red/tasks</filename> et dans <filename>/rootgroup/blue/tasks</filename>) obtiendra 33.33% de la CPU :

source: Any other processes placed in subgroups <literal>blue</literal> and <literal>red</literal> result in the 33.33% percent of the CPU assigned to that specific subgroup to be split among the multiple processes in that subgroup.
fr: Tout autre processus placé dans les sous-groupes <literal>blue</literal> et <literal>red</literal> obtiendra sa part des 33.33% de la CPU assignée à ce sous-groupe qui les partagera entre chacun de ses processus.

source: However, multiple processes placed in the root group cause the CPU resource to be split per process, rather than per group. For example, if <filename>/rootgroup/</filename> contains three processes, <filename>/rootgroup/red/</filename> contains one process and <filename>/rootgroup/blue/</filename> contains one process, and the <filename>cpu.shares</filename> option is set to <literal>1</literal> in all groups, the CPU resource is divided as follows:
fr: Cependant, plusieurs processus placés dans le groupe racine entraîneront un partage par processus plutôt que par sous-groupe. Par exemple, si <filename>/rootgroup/</filename> contient trois processus, si <filename>/rootgroup/red/</filename> en contient un et <filename>/rootgroup/blue/</filename> un autre, et que l'option <filename>cpu.shares</filename> est définie à <literal>1</literal> dans tous les groupes, alors la ressource CPU sera répartie comme suit :

source: Therefore, it is recommended to move all processes from the root group to a specific subgroup when using the <systemitem class="resource">blkio</systemitem> and <systemitem class="resource">cpu</systemitem> configuration options which divide an available resource based on a weight or a share (for example, <filename>cpu.shares</filename> or <filename>blkio.weight</filename>). To move all tasks from the root group into a specific subgroup, you can use the following commands:
fr: Ainsi, il est recommandé de déplacer tous les processus du groupe racine vers un sous-groupe spécifique lorsque les options de configuration sur <systemitem class="resource">blkio</systemitem> et <systemitem class="resource">cpu</systemitem> divisent les ressources disponibles sur la base d'un poids ou d'un découpage (par exemple, <filename>cpu.shares</filename> ou <filename>blkio.weight</filename>). Pour déplacer toutes les tâches d'un groupe racine dans un sous-groupe spécifique, il est possible d'utiliser la commande suivante :

source: rootgroup]# <command>cat tasks &gt;&gt; red/tasks</command> rootgroup]# <command>echo &gt; tasks</command>
fr: rootgroup]#&nbsp;<command>cat tasks &gt;&gt; red/tasks</command> rootgroup]#&nbsp;<command>echo &gt; tasks</command>

source: Generating the /etc/cgconfig.conf File
fr: Génération du fichier /etc/cgconfig.conf

source: Configuration for the <filename>/etc/cgconfig.conf</filename> file can be generated from the current cgroup configuration using the <application>cgsnapshot</application> utility. This utility takes a snapshot of the current state of all subsystems and their cgroups and returns their configuration as it would appear in the <filename>/etc/cgconfig.conf</filename> file. <xref linkend="ex-cgsnapshot-usage" /> shows an example usage of the <application>cgsnapshot</application> utility.
fr: La configuration du fichier <filename>/etc/cgconfig.conf</filename> peut être générée depuis la configuration cgroup actuelle en utilisant l'utilitaire <application>cgsnapshot</application>. Cet utilitaire prend un cliché de l'état courant de tous les sous-sytèmes et de leurs groupes de contrôles et renvoie leur configuration telle qu'elle pourrait apparaître dans le fichier <filename>/etc/cgconfig.conf</filename>. Le paragraphe <xref linkend="ex-cgsnapshot-usage" /> montre un exemple d'utilisation de l'utilitaire <application>cgsnapshot</application>.

source: Using the cgsnapshot utility
fr: Utilisation de l'utilitaire cgsnapshot

source: Assume we configured cgroups on our system using the following commands:
fr: Partons du principe que cgroups a été configuré sur notre système à l'aide des commandes suivantes :

source: The above commands mounted two subsystems and created two cgroups, for the <systemitem>cpu</systemitem> subsystem, with specific values for some of their parameters. Executing the <command>cgsnapshot</command> command (with the <option>-s</option> option and an empty <filename>/etc/cgsnapshot_blacklist.conf</filename> file<footnote id="footnote-default-cpu-shares"> <para>The <systemitem>cpu.shares</systemitem> parameter is specified in the <filename>/etc/cgsnapshot_blacklist.conf</filename> file by default, which would cause it to be omitted in the generated output in <xref linkend="ex-cgsnapshot-usage" />. Thus, for the purposes of the example, an empty <filename>/etc/cgsnapshot_blacklist.conf</filename> file is used.</para> </footnote>) then produces the following output:
fr: Les commandes ci-dessus montent deux sous-systèmes et créent deux cgroups pour le sous-système<systemitem>cpu</systemitem>, avec des valeurs spécifiques pour certains de leurs paramètres. L'utilisation de la commande <command>cgsnapshot</command> (avec l'option <option>-s</option> et un fichier <filename>/etc/cgsnapshot_blacklist.conf</filename> vide<footnote id="footnote-default-cpu-shares"> <para>Le paramètre <systemitem>cpu.shares</systemitem> est spécifié dans le fichier <filename>/etc/cgsnapshot_blacklist.conf</filename> par défaut, ce qui provoque son omission dans l'affichage dans <xref linkend="ex-cgsnapshot-usage" />. Ainsi, pour les besoins de l'exemple, un fichier <filename>/etc/cgsnapshot_blacklist.conf</filename> vide sera utilisé.</para> </footnote>) produit l'affichage suivant :

source: The <option>-s</option> option used in the example above tells <application>cgsnapshot</application> to ignore all warnings in the output file caused by parameters not being defined in the blacklist or whitelist of the <application>cgsnapshot</application> utility. For more information on parameter blacklisting, refer to <xref linkend="sec-cgsnapshot_blacklist" />. For more information on parameter whitelisting, refer to <xref linkend="sec-cgsnapshot_whitelist" />.
fr: L'option <option>-s</option> utilisée dans l'exemple qui précéde indique à <application>cgsnapshot</application> d'ignorer tous les avertissements dans le fichier de sortie résultant de paramètres indéfinis dans la liste noire ou la liste blanche de l'utilitaire <application>cgsnapshot</application>. Pour plus d'informations sur les listes noires de paramètres, cf. <xref linkend="sec-cgsnapshot_blacklist" />. Pour plus d'informations sur les listes blanches de paramètres, cf. <xref linkend="sec-cgsnapshot_whitelist" />.

source: When not specifying any options, the output generated by <application>cgsnapshot</application> is returned on the standard output. Use the <option>-f</option> to specify a file to which the output should be redirected. For example:
fr: Lorsqu'aucune option n'est spécifiée, l'affichage provenant de <application>cgsnapshot</application> est envoyé sur la sortie standard. Utiliser l'option <option>-f</option> pour spécifier un fichier vers lequel rediriger la sortie. Par exemple :

source: The -f option overwrites the specified file
fr: L'option -f écrase le fichier spécifié

source: When using the <option>-f</option> option, note that it overwrites any content in the file you specify. Therefore, it is recommended not to direct the output straight to the <filename>/etc/cgconfig.conf</filename> file.
fr: Noter que l'utilisation de l'option <option>-f</option> écrasera tout contenu dans le fichier spécifié. Ainsi, il est recommandé de ne pas rediriger la sortie vers le fichier <filename>/etc/cgconfig.conf</filename>.

source: The cgsnapshot utility can also create configuration files per subsystem. By specifying the name of a subsystem, the output will consist of the corresponding configuration for that subsystem:
fr: L'utilitaire <application>cgsnapshot</application> peut aussi créer des fichiers de configuration par sous-système. Si un sous-système est spécifié par son nom, la sortie en sera la configuration correspondante :

source: Blacklisting Parameters
fr: Paramètres en liste noire

source: The <application>cgsnapshot</application> utility allows parameter blacklisting. If a parameter is blacklisted, it does not appear in the output generated by <application>cgsnapshot</application>. By default, the <filename>/etc/cgsnapshot_blacklist.conf</filename> file is checked for blacklisted parameters. If a parameter is not present in the blacklist, the whitelist is checked. To specify a different blacklist, use the <option>-b</option> option. For example:
fr: L'utilitaire <application>cgsnapshot</application> permet de mettre des paramètres en liste noire. Ainsi, si un paramètre est sur liste noire , il n'apparaitra pas dans le résultat de la commande <application>cgsnapshot</application>. Le fichier <filename>/etc/cgsnapshot_blacklist.conf</filename> contient la liste par défaut des paramètres en liste noire. Si un paramètre est absent de la liste noire, la liste blanche est utilisée. Pour spécifier une liste noire différente de celle par défaut, utiliser l'option <option>-b</option>. Par exemple :

source: Whitelisting Parameters
fr: Paramètres en liste blanche

source: The <application>cgsnapshot</application> utility also allows parameter whitelisting. If a parameter is whitelisted, it appears in the output generated by <application>cgsnapshot</application>. If a parameter is neither blacklisted or whitelisted, a warning appears informing of this:
fr: L'utilitaire <application>cgsnapshot</application> permet aussi de mettre des paramètres en liste blanche. Si un paramètre est sur liste blanche , il apparaitra dans le résultat de la commande <application>cgsnapshot</application>. Si un paramètre n'est ni sur liste noire ni sur liste blanche, un avertissement sera affiché pour en informer l'utilisateur :

source: By default, there is no whitelist configuration file. To specify which file to use as a whitelist, use the <option>-w</option> option. For example:
fr: Par défaut, il n'y a pas de fichier de configuration de liste blanche. L'option <option>-w</option> permet de préciser le fichier à utiliser en tant que liste blanche. Par exemple :

source: Specifying the <option>-t</option> option tells <application>cgsnapshot</application> to generate a configuration with parameters from the whitelist only.
fr: Le fait de spécifier l'option <option>-t</option> indique à<application>cgsnapshot</application> de renvoyer une configuration avec uniquement les paramètres en liste blanche.

source: Obtaining Information About Control Groups
fr: Obtenir des informations sur les groupes de contrôle

source: Finding a Process
fr: Trouver un processus

source: To find the cgroup to which a process belongs, run:
fr: Pour trouver le groupe de contrôle auquel un processus appartient, exécuter :

source: Or, if you know the PID for the process, run:
fr: Ou bien, si le PID du processus est connu, exécuter :

source: Finding a Subsystem
fr: Trouver un sous-système

source: To find the subsystems that are available in your kernel and how are they mounted together to hierarchies, run:
fr: Pour trouver les sous-systèmes disponibles dans le noyau et la façon dont ils sont montés ensembles sur des hiérarchies, exécuter :

source: Or, to find the mount points of particular subsystems, run:
fr: Sinon, pour trouver les points de montage de sous-systèmes particuliers, exécuter :

source: where <replaceable>subsystems</replaceable> is a list of the subsystems in which you are interested. Note that the <command>lssubsys -m</command> command returns only the top-level mount point per each hierarchy.
fr: ou <replaceable>subsystems</replaceable> est une liste des sous-systèmes intéressant l'utilisateur. Remarquer que la commande <command>lssubsys -m</command> retourne uniquement le point de montage le plus haut de chaque hiérarchie.

source: Finding Hierarchies
fr: Trouver des hiérarchies

source: We recommend that you mount hierarchies under <filename>/cgroup</filename>. Assuming this is the case on your system, list or browse the contents of that directory to obtain a list of hierarchies. If <application>tree</application> is installed on your system, run it to obtain an overview of all hierarchies and the cgroups within them:
fr: Il est recommandé de monter les hiérarchies sous <filename>/cgroup</filename>. En supposant que ce soit le cas sur votre système, répertorier ou naviguer sur le contenu de ce répertoire pour obtenir une liste des hiérarchies. Si <application>tree</application> est installé sur votre système, l'exécuter pour obtenir une vue d'ensemble de toutes les hiérarchies et de tous les groupes de contrôle qui s'y trouvent :

source: Finding Control Groups
fr: Trouver des groupes de contrôle

source: To list the cgroups on a system, run:
fr: Pour répertorier les groupes de contrôle sur un système, exécuter :

source: You can restrict the output to a specific hierarchy by specifying a controller and path in the format <literal><replaceable>controller</replaceable>:<replaceable>path</replaceable></literal>. For example:
fr: Il est possible de restreindre la sortie à une hiérarchie spécifique en précisant un contrôleur et un chemin sous le format <literal><replaceable>controller</replaceable>:<replaceable>path</replaceable></literal>. Par exemple :

source: lists only subgroups of the <filename>adminusers</filename> cgroup in the hierarchy to which the <systemitem>cpuset</systemitem> subsystem is attached.
fr: répertorie uniquement les sous-groupes du groupe de contrôle <filename>adminusers</filename> dans la hiérarchie à laquelle le sous-système <systemitem>cpuset</systemitem> est attaché.

source: Displaying Parameters of Control Groups
fr: Afficher les paramètres des groupes de contrôle

source: To display the parameters of specific cgroups, run:
fr: Pour afficher les paramètres de groupes de contrôle spécifiques, exécuter :

source: where <replaceable>parameter</replaceable> is a pseudo-file that contains values for a subsystem, and <replaceable>list_of_cgroups</replaceable> is a list of cgroups separated with spaces. For example:
fr: où <replaceable>parameter</replaceable> est un pseudo-fichier contenant les valeurs d'un sous-système et <replaceable>list_of_cgroups</replaceable> est une liste des groupes de contrôle séparés par des espaces. Par exemple :
